[{
    "secao": "Capítulo 4 – Rotinas Bancárias",
    "subsecao": null,
    "unidades": [
        {
            "unidade": [
                "CONTEXTUALIZANDO",
                "Pois é, meu caro estudante, chegamos ao último ponto da nossa viagem pelo mundo da Contabilidade e da Gestão Financeira. Aprendemos muito e, para finalizar com chave de ouro, vamos estudar sobre as rotinas bancárias, porque elas também fazem parte do cotidiano de uma empresa. Juntos, vamos executar estas rotinas, que incluem o uso de cheques, cartões de crédito, ordens de pagamento, débito automático, transferências (PIX e TED) e depósitos. Também, será apresentado como realizar uma conciliação bancária. Bora lá, conhecer esses novos conceitos!",
                "",
                "Você pode até estar achando que este tema está distante do seu dia a dia, mas, quando a gente for tratar dos assuntos, será possível perceber que eles podem também estarem presentes na sua vida pessoal. Portanto, fique atento para aprender tudo!",
                "Rotinas Bancárias: são todas aquelas tarefas que o setor financeiro de uma empresa realiza com o banco, com frequência.",
                "",
                "Para garantir um bom resultado no setor financeiro, é necessário realizar várias atividades com os bancos, quando usamos a expressão rotina, é porque estas atividades são feitas praticamente todos os dias, exigindo do profissional do setor financeiro, um conhecimento sobre as transações bancárias. Pois ele precisa saber como fazer e garantir que estão corretas. Para facilitar a execução dessas atividades, existem algumas ferramentas que auxiliam muito.",
                "Veja algumas:",
                "Figura 38 – exemplos de ferramentas",
                "Agora, vamos conhecer algumas dessas atividades, vem comigo!",
                "4.1 Cheque",
                "#IMAGEM#",
                "",
                "Esse é bem antigo, do fundo do baú! Mas, antes de explicar sobre o cheque, quero saber se você já viu alguém o utilizando por aí?",
                "",
                "Enquete:",
                "Você já viu alguém utilizando um cheque?",
                "",
                "(  ) Sim",
                "(  ) Não",
                "",
                "Para a geração que nasceu neste mundo digital, talvez seja estranho pensar em algo mais formal e burocrático, e ainda envolvendo o preenchimento de um papel. Mas, a verdade é que ainda existem pessoas e empresas que utilizam o cheque. Por isso, vamos conhecer essa ferramenta.",
                "Cheque: é uma ordem de pagamento à vista, que deve ser pago no momento de apresentação junto ao banco sacado.",
                "O cheque é um documento impresso, que deve ser solicitado junto ao banco, onde a empresa tenha a conta, ela recebe um de talão de cheque. Dentro deste talão, tem várias folhas de cheque, que poderão ser utilizadas para pagamentos.",
                "Quando alguém preenche um cheque, está dizendo para o banco para tirar dinheiro da sua conta e pagar para a pessoa indicada.",
                "Vamos conhecer uma folha de cheque e quais dados contém nela:",
                "#IMAGEM#",
                "",
                "1 – Neste espaço é escrito o valor em reais que será pago, ele deve estar bem legível e sem rasuras. Para ter mais segurança, de modo a evitar fraudes, antes do número pode colocar um símbolo de #, isso evita que alguém possa alterar o valor a ser descontado.",
                "2 – Colocar a descrição do valor por extenso, com letra legível e sem rasuras. Para evitar fraudes, colocar o valor entre parênteses, e no espaço restante, colocar um traço.",
                "3 – Após o valor por extenso, deve–se escrever o nome da empresa ou pessoa, a quem é direcionado este cheque.",
                "4 – Neste campo, é preenchido com a cidade e data do preenchimento do cheque.",
                "5 – A sua assinatura deve ser a mesma que está na carteira de identidade, pois é uma maneira do banco verificar se foi você mesmo que preencheu o cheque.",
                "Esses são os dados principais que serão preenchidos no cheque, mas veja, pelo fato de ser manual, deve–se ter mais cuidado com golpes e furtos, pois a segurança é menor do que no digital.",
                "#FIQUELIGADO#",
                "Assista o vídeo abaixo, onde ensina como deve preencher um cheque:",
                "https://www.facebook.com/watch/?v=1838544249788813",
                "#FIQUELIGADO#",
                "Buscando maior segurança, tem algumas ações que auxiliam, uma delas é cruzar o cheque, basta sinalizar com duas linhas (conforme a figura abaixo), isto indica que quem estiver com seu cheque não pode sacar o dinheiro no caixa, o cheque deve ser depositado.",
                "Outra ação, que aumenta a segurança, é colocar o cheque nominal, isso quer dizer que, só pode depositar na conta daquela pessoa, que tem o nome escrito no cheque. Estas simples ações, já auxiliam na redução de golpes em cheques.",
                "#IMAGEM#",
                "",
                "Muitas empresas têm receio de aceitar cheque, porque pode acontecer o famoso Cheque sem Fundo.",
                "#IMAGEM#",
                "Ele é uma verdadeira amolação. Pois a pessoa vai no banco para resgatar o dinheiro, porém descobre que aquele cheque não tem valor, porque não tem dinheiro na conta de quem emitiu o cheque. Isso é um problemão, pois talvez o destinatário demore ou nunca receba aquele cheque.",
                "E aí, percebeu como é simples e fácil trabalhar com cheque? Agora, bora conhecer na prática como preencher um cheque?",
                "Questão 1",
                "1. Preencha o cheque abaixo com a seguinte situação:",
                "José Carlos estava devendo R$500,00 para Alexandre Ribeiro, ele realizou o pagamento em cheque cruzado, no dia 01 de fevereiro de 2024, na cidade de São Luiz.",
                "#IMAGEM#",
                "4.2 Cartão de Crédito",
                "Esse é bem conhecido do pessoal, e muitos de vocês já devem ter um.",
                "",
                "",
                "",
                "",
                "Cartão de crédito: é uma forma de empréstimo realizado de maneira eletrônica, com prazo para pagamento de até 40 dias.",
                "#IMAGEM#",
                "",
                "O cartão de crédito facilita muito a organização das finanças das contas a pagar, pois é possível concentrar todas as despesas em uma única fatura, ficando mais fácil o controle, também pode-se parcelar em várias vezes, sem juros ou com juros menores. Numa emergência, onde é necessário comprar algo e naquele momento não tem dinheiro em caixa, pode-se usar o cartão para pagamento posterior.",
                "Mas, já vale ressaltar aqui, que o cartão de crédito deve ser usado de forma consciente e disciplinada, porque senão, pode gerar muitas dívidas e dor de cabeça",
                "Quando o cartão de crédito é utilizado, é como se o banco financiador estivesse te emprestando aquele valor, para você pagar aquela conta realizada naquele momento. O prestador de serviços que passou o cartão, irá receber o valor da operadora, então ele não gera vínculo direto com o cliente, como no caso do cheque. Pois o cliente deverá pagar para o banco do cartão.",
                "No cartão de crédito tem alguns números, que são importantes, vamos ver o que eles são:",
                "#IMAGEM#",
                "As compras online, tiveram um crescimento significativo nos últimos anos, principalmente incentivado, pelo período da pandemia. E devido a esse volume de transação, foi criado o cartão de crédito virtual, que funciona do mesmo modo que o físico, mas fornece maior segurança, pois os dados do cartão são alterados para aquele uso específico. Cada operadora de cartão estabelece o seu modo de disponibilizar o cartão virtual.",
                "No caso da Nubank, basta acessar o aplicativo e solicitar o uso do cartão virtual, então, eles geram um cartão com novo número e CVV, que um tempo de duração de 24 horas. Após esse período, ele é cancelado pela Nubank. O uso do cartão virtual oferece maior confiança para o consumidor, e por consequência dificulta a vida daquele pessoal que só fica online, buscando dar golpes nas pessoas.",
                "#CURIOSIDADE#",
                "De acordo com o site do CNN (Rede de Notícias à Cabo) somente na primeira metade de 2024 o Brasil já registrou mais de 1 milhão de tentativas de fraude, totalizando R$ 1,2 bilhão.",
                "Para o levantamento destes dados foram considerados pagamentos via cartão de crédito no setor de e-commerce (comércio eletrônico).",
                "#CURIOSIDADE#",
                "A maioria das tentativas de fraude no e-commerce brasileiro acontece através do roubo de dados, de conta e senhas.",
                "Para ter acesso a reportagem completa acessa o link abaixo:",
                "Link: https://www.cnnBrasil.com.br/economia/financas/tentativas–de–fraude–ja–somam–r–12–bi–em–2024–veja–data–hora–e–alvos–preferidos–de–golpistas/"
            ]
        },
        {
            "unidade": [
                "APROFUNDANDO",
                "Se liga nesta, porque se trata de uma parada muito séria: a fatura do cartão chegou e a pessoa não tem dinheiro para pagar”",
                "#IMAGEM#",
                "",
                "Chegou a data de pagar a fatura do cartão! Mas, as vezes pode acontecer de o usuário do cartão, que pode ser empresarial ou pessoal, não ter dinheiro em caixa para efetuar o pagamento.",
                "Então, a operadora do cartão, gentilmente, só que não! Te oferece opções para o pagamento deste cartão, que podem ser: pagamento mínimo, crédito rotativo ou parcelamento.",
                "No pagamento mínimo, é possível pagar 15% a 20% do valor daquela fatura, porém na próxima fatura isso não poderá se repetir, ou seja, ou seja, no próximo vez, deve–se pagar a fatura do mês e a “atrasada”, acrescida de juros e encargos.",
                "No crédito rotativo, que possibilita ao cliente pagar um pouco do valor da fatura, sendo que o valor pago será acima do mínimo e abaixo do total da fatura. Esta modalidade pode até parecer atrativa num primeiro momento, principalmente quando não se tem todo o dinheiro para pagar. Mas, cuidado: ao utilizar esta modalidade, a operadora poderá te cobrar juros e demais encargos, que podem ser altíssimos.",
                "No parcelamento, a fatura é parcelada com a operadora, e os valores são renegociados, e também serão cobrados juros e encargos.",
                "DICA: nunca deixe de pagar a fatura do cartão em dia, isso pode gerar problemas enormes para o financeiro de uma empresa, e é claro também na sua vida pessoal.",
                "4.3 Ordem de pagamento",
                "",
                "A ordem de pagamento pode ser usada tanto para empresa e para pessoa física, então, atenção, para aprender ela direitinho.",
                "Ordem de pagamento: é um serviço bancário que permite enviar uma remessa de dinheiro, através de uma autorização, chamada Ordem de pagamento.",
                "As coisas funcionam assim: a empresa quer pagar algum prestador, então ela emite uma ordem de pagamento, que pode ser física ou eletrônica (é necessário verificar quais banco oferecem este serviço), e então o destinatário recebe uma comunicação, de que tem um valor liberado para ele naquele banco. Essa transação pode ser de uma conta para outra no mesmo banco, ou pode ser também para alguém que não possui conta.",
                "Normalmente uma pessoa que recebe uma ordem de pagamento, tem um tempo de 24 horas, para resgatar o valor. Mas este tempo pode variar de um banco para outro.",
                "A ordem de pagamento pode ser usada em transações nacionais e internacionais, mas sempre confira as taxas antes!",
                "Podemos dizer que, a ordem de pagamento traz uma segurança para quem paga, pois dá uma impressão de maior controle, até mesmo, por ser mais burocrática. Mas se a pessoa que for receber não tiver conta no mesmo banco, ela vai pegar o valor em espécie e deverá sair do banco com ele, então, neste caso pode ser tornar um risco, porque existem muitos criminosos, que ficam de olho em quem sai dos bancos, para aplicar o famoso “golpe da saidinha”.",
                "#CURIOSIDADE#",
                "O Golpe da saidinha de banco é uma modalidade de crime, que consiste no assalto realizado logo após a vítima sacar uma quantia em valor no banco. Infelizmente, este tipo de crime é muito comum no Brasil.",
                "#CURIOSIDADE#",
                "#IMAGEM#",
                "",
                "Quando for preencher uma ordem de pagamento, o usuário deve estar atento às informações solicitadas.",
                "Abaixo estão listadas, as principais:",
                "1 – Verifique os dados da pessoa ou empresa que irá receber:",
                "Nome completo,  CPF ou CNPJ, número do banco, agência e conta (quando tiver conta no mesmo banco). Se for para o exterior, é preciso do código SWIFT do banco e IBAN da conta.",
                "2 – Acesso ao serviço de ordem de pagamento no banco: atualmente, a maioria dos bancos permite realizar ordens de pagamento por meio de aplicativo ou site, mas alguns ainda preferem que façam esta transação diretamente na agência.",
                "3 – Escolha a moeda e o valor a ser enviado: local ou estrangeira (no caso de transação internacional).",
                "4 – Verifique as taxas: é importante verificar o quanto o banco vai cobrar por este serviço, para não assustar depois, com o valor das taxas.",
                "5 – Confirme os dados informados e realize a transação: o dinheiro é enviado, e quem receberá o pagamento precisa retirar esse valor com a agência bancária indicada, ou poderá receber em conta, caso tenha conta no mesmo banco da transação.",
                "",
                "#IMAGEM#",
                "4.4 Débito automático",
                "Antes de tratar o tema, quero saber!",
                "Enquete:",
                "Você sabe o que é um débito automático?",
                "(  ) SIM",
                "(  ) NÃO",
                "",
                "Se sim, defina com suas palavras:",
                "Agora, vamos lá!",
                "Débito automático: é um serviço disponibilizado por bancos e outras instituições financeiras para quitar automaticamente as contas recorrentes (que repete com frequência), usando o saldo disponível que o cliente tem em sua conta cadastrada.",
                "Então, para usar o débito automático, sempre tem quer dinheiro na conta? Isso mesmo, se não tiver saldo, pode ter problemas! Caso o cliente tenha limite de cheque especial, essa conta poderá ser descontada no limite, porém, isso vai gerar uma taxa que vai, de certa forma aumentar a dívida, ou, se não tiver limite de cheque especial, deverá ser gerado um boleto para quitação.",
                "De forma geral, o débito automático é utilizado para pagar contas recorrentes, ou seja, aquelas que acontecem com frequência, tipo: água, telefone, energia, um empréstimo que teve várias parcelas, porque assim, os pagamentos já estando programados, evita a possibilidade de esquecimento.",
                "DICA: mas sempre esteja atento a sua conta, e acompanhe as movimentações, isso ajuda a prevenir golpes, ou cobranças de taxas indevidas.",
                "4.5 Transferências",
                "Para facilitar a vida de quem trabalha no setor financeiro, tem-se várias opções de formas de pagamento, que serão escolhidas de acordo com aquela que melhor se adapta à realidade daquela empresa. As transferências bancárias, são muito utilizadas, por causa de sua facilidade e agilidade.",
                "Neste tópico, vamos apresentar as ferramentas de PIX e TED. Vamos lá?",
                "4.5.1 PIX",
                "Aqui, podemos dizer sem medo de errar, que o PIX hoje é o mais queridinho da galera.",
                "#IMAGEM#",
                "PIX: é um sistema de pagamento instantâneo criado pelo Banco Central do Brasil em 2020, que permite transferir dinheiro entre contas bancárias de forma rápida.",
                "",
                "Em um mundo digital, onde tudo acontece com a velocidade da luz, o PIX surgiu como uma ideia revolucionária no meio de pagamentos, pois ele é muito rápido. Este é um dos motivos principais de sua enorme aceitação, tanto no ambiente empresarial, quanto no pessoal.",
                "#IMAGEM#",
                "",
                "Outro fator que popularizou o PIX dessa maneira é o fator de ser gratuito, em um ambiente onde se paga taxas para tudo. Ter um serviço gratuito é um enorme atrativo. Ele também é seguro, e é realizado dentro do sistema do Banco Central, porém deve–se ter cuidado, para não fazer transações erradas.",
                "Para realizar um PIX é muito fácil:",
                "Basta ter um celular ou um computador, e a chave PIX da conta para qual deseja transferir o valor. As chaves podem ser CPF (pessoas) ou CNPJ (empresas), número de telefone, e–mail ou alguma chave aleatória.",
                "Infográfico – passo a passo do pix",
                "1 – Acesse o aplicativo ou o site do banco, onde está a conta;",
                "2 – Procure a opção “pix”, escolha “pagar com pix” ou “transferir com pix”;",
                "3 – Insira a chave pix da conta para a qual deseja transferir o dinheiro;",
                "4 – Digite o valor a ser enviado;",
                "5 – Confirme os dados;",
                "– Autorize a transferência.",
                "Pronto! Em segundos, o valor será enviado!",
                "#ATENCAO#",
                "Atenção: muito cuidado no momento de confirmar os dados, faça esta etapa com calma e cautela para não transferir dinheiro para conta errada. Muitos criminosos estão de olho para dar golpes relacionados a PIX, também estejam atentos.",
                "#ATENCAO#",
                "",
                "#CURIOSIDADE#",
                "Enquete:",
                "Você acha que os bancos perderam dinheiro após a implantação do PIX?",
                "(  ) Sim",
                "(  ) Não",
                "",
                "Escreva abaixo a resposta que a professora vai apresentar:",
                "#CURIOSIDADE#",
                "4.5.2 TED – Transferência Eletrônica Disponível",
                "A Transferência Eletrônica Disponível, popularmente chamada de TED é um dos métodos mais antigos de transferência bancária, mas ainda é bastante utilizado. Vamos ver um pouco do que se trata.",
                "TED (Transferência Eletrônica Disponível): transferência bancária que permite enviar dinheiro entre contas de diferentes bancos no mesmo dia, desde que a transação seja realizada até às 17h.",
                "O TED ao contrário do PIX, não é instantâneo, ele será analisado e liberado pela instituição responsável pelo valor. Mas então, você pode estar pensando, por que escolher utilizar o TED?",
                "Pois bem, porque no TED não tem valor mínimo para transação, então ele é ideal para pagamentos de valores mais altos, pois transmite segurança.",
                "Para realizar uma transferência via TED, deverá ser informado os dados bancários do destinatário, como nome completo, CPF ou CNPJ, número da conta e agência. O valor transferido cai na conta do destinatário no mesmo dia, desde que a transação seja feita dentro do horário de expediente bancário.",
                "Abaixo está apresentado um quadro comparativo entre o PIX e o TED, vamos avaliar as principais diferenças entre eles:",
                "#IMAGEM#",
                "Agora, responda: qual é o melhor?",
                "(  ) PIX",
                "( ) TED",
                "(  ) Depende do tipo de transação financeira que a empresa precisa.",
                "4.6 Depósitos",
                "Uau, estamos quase terminando a nossa disciplina. Aprendemos muito, não é mesmo?",
                "Enquete:",
                "Você já realizou um depósito bancário?",
                "(  ) SIM",
                "(  ) NÃO",
                "Neste tópico, vamos falar sobre depósito bancário, mas antes de começarmos, quero saber se você já fez um depósito bancário.",
                "Depósito Bancário: É uma transação financeira realizada por uma pessoa no caixa eletrônico, onde deposita dinheiro em uma conta bancária.",
                "Para realizar o depósito bancário, a pessoa deve-se deslocar até o banco, onde deseja efetuar a operação, alguns bancos disponibilizam envelopes, onde deverão servir para colocar o dinheiro ou cheque que será depositado, mas nos bancos modernos, o dinheiro pode ser colocado diretamente no caixa eletrônico, dispensando o uso do envelope.",
                "Vamos considerar aqui, que estamos em um agência da Caixa, que ainda utiliza envelope, tudo bem? Então, após preencher este envelope, o usuário deve ir até um caixa eletrônico, e efetuar o depósito.",
                "#IMAGEM#",
                "Após receber o depósito, o banco irá processar o envelope depositado, onde irá abri-lo, conferir os dados e valor mencionados no envelope. Se estiver tudo certo, o dinheiro é depositado na conta de destino. Os depósitos que forem realizados após o horário de expediente do banco, serão considerados no próximo dia útil.",
                "#IMAGEM#",
                "No momento de realizar o depósito, sempre esteja atento às informações que serão solicitadas. No caso do envelope mostrado acima, note que só podemos colocar no máximo 30 cédulas em dinheiro ou 30 cheques, sem dobrar. Da mesma maneira, se o depósito for em dinheiro, diretamente no caixa eletrônico, é necessário tomar cuidado.",
                "Após realizar o depósito, é emitido pelo caixa eletrônico um comprovante que deve ser guardado, para segurança, pelo menos até que o dinheiro esteja na conta de destino.",
                "MAS O QUE ACONTECE SE UMA PESSOA MÁ INTENCIONADA, DEPOSITAR UM ENVELOPE VAZIO, A FIM DE ENGANAR O BANCO?",
                "Isso é um tipo de golpe que se trata do crime de Estelionato, que é definido no artigo 171 do Código Penal como: “Obter, para si ou para outrem, vantagem ilícita, em prejuízo alheio, induzindo ou mantendo alguém em erro, mediante artifício, ardil, ou qualquer outro meio fraudulento”",
                "#CURIOSIDADE#",
                "Veja só o que aconteceu em Itajaí/SC:",
                "Uma mulher foi condenada por Estelionato, porque depositou um envelope vazio, simulando ter pago o aluguel de sua casa. Ela disse ao proprietário que havia depositado o dinheiro, conforme descrito em seu comprovante de depósito bancário. Mas era pura enganação! Que vergonha, hein?",
                "#CURIOSIDADE#",
                "",
                "Caso queira ler a reportagem completa, basta acessar o link abaixo:",
                "https://omunicipioblumenau.com.br/golpe–do–deposito–de–envelope–vazio–em–caixa–eletronico–acaba–em–condenacao–no–vale/",
                "4.7 Conciliação Bancária",
                "Vamos tratar nosso último tópico sobre conciliação bancária, por aqui, finalizamos com chave de ouro, todo o aprendizado que vimos durante esta disciplina. Bora, conhecer o que é a conciliação bancária.",
                "Conciliação Bancária: É um processo que consiste em verificar se as entradas e saídas do caixa da empresa estão condizentes com as movimentações registradas nos extratos de suas contas bancárias.",
                "Sabemos que organizar as contas é uma importante tarefa de quem trabalha no departamento financeiro, afinal, são muitas as movimentações que podem ocorrer. Afinal, o dinheiro chega ao caixa de diversas formas, como vimos (transferências, PIX, TED, depósitos, ordem de pagamento, cartão, boletos, etc.) e em diferentes prazos.",
                "Devido a essa intensa movimentação, é realizada a conciliação bancária, que permite verificar se está conforme os registros no fluxo de caixa com os registros realizados no banco. Esse controle permite realizar uma comparação, verificando despesas, pagamentos recebidos e saldo disponível. Assim, é possível entender se as movimentações previstas foram de fato feitas ou se os resultados apresentam alguma discrepância com o que estava planejado.",
                "Para realizar a conciliação bancária é importante estabelecer uma rotina e determinar a periodicidade que será realizada, isso dependerá de cada empresa, dependendo da quantidade de movimentação que a empresa realiza.",
                "Para realizar a conciliação deve seguir os seguintes passos:",
                "Obter o extrato bancário: o primeiro passo é retirar o extrato bancário com todas as movimentações do período determinado. Atualmente as empresas podem acessar o extrato de forma online, o que auxilia bastante;",
                "Comparar com os registros internos: agora, é hora de comparar o extrato bancário com os registros internos da empresa. Não se esqueça de guardar/arquivar notas fiscais, extratos e comprovantes de pagamentos.",
                "Identificar as diferenças: se tiver diferença, ou seja, se algum lançamento interno não aparecer no extrato bancário ou vice e versa, é necessário entender o motivo e rastrear o que aconteceu;",
                "Corrigir divergências: depois de encontrar as diferenças, corrigir o que for necessário. Pode ser preciso ajustar o registro interno ou entrar em contato com o banco, caso tenha identificado alguma irregularidade no extrato;",
                "Finalizar e Arquivar: por fim, registrar a conciliação bancária e arquivar, para conferência futura, caso seja necessário.",
                "#FIQUELIGADO#",
                "Cara, tem um short bem bacana, sobre conciliação bancária, ele é bem simples, mas é tudo que você precisa saber. Bora lá, assistir!",
                "Vídeo: conciliação bancária 4 passos",
                "https://www.youtube.com/shorts/TNWeyAsOq8w?feature=share",
                "#FIQUELIGADO#",
                "A melhor maneira de entender uma parada, é acompanhar ela acontecendo não é mesmo? Então, vamos realizar um praticando envolvendo a conciliação bancária:"
            ]
        },
        {
            "unidade": [
                "PRATICANDO",
                "A empresa \"Maranhão Festas\" fez as seguintes movimentações em novembro de 2024. O gerente pediu que você, como assistente financeiro, faça a conciliação bancária e identifique o saldo conciliado.",
                "Aqui está o extrato bancário, no período de 01/11/24 a 30/11/24",
                "#IMAGEM#",
                "Estes são os registros internos da empresa.",
                "#IMAGEM#",
                "O próximo passo é comparar o extrato bancário com os registros internos. Observe como ficou o saldo final no extrato:",
                "#IMAGEM#",
                "Comparando os saldos finais, observamos a seguinte situação:",
                "Saldo final no extrato bancário: R$ 3 450,00",
                "Saldo final nos registros interno: R$ 5 950,00",
                "Os resultados estão diferentes. Logo, significa que tem algo para resolver!",
                "Vamos analisar e encontrar a diferença: após comparar o extrato e o registro, foi possível identificar que no registro interno, houve um erro de lançamento em duplicidade. O registro de Venda no PIX, foi lançado em 10/11 e novamente em 15/11. Portanto, o lançamento de 15/11 deve ser desconsiderado.",
                "Fazendo as correções temos a seguinte situação:",
                "#IMAGEM#",
                "Agora, sim, está tudo conforme!",
                "Saldo final no extrato bancário: R$ 3 450,00",
                "Saldo final nos registros interno: R$ 3 450,00",
                "Após realizar as correções necessárias, basta finalizar e arquivar a conciliação bancária.",
                "E aí, viu, como conciliação é o segredo para manter as contas na linha? Então, bora ficar atentos!"
            ]
        },
        {
            "unidade": [
                "SINTETIZANDO",
                "Neste capítulo, exploramos detalhadamente a rotina bancária, essencial para o funcionamento eficaz das finanças pessoais e empresariais. Iniciamos com o cheque, uma forma tradicional de pagamento que ainda possui relevância em certas transações, apesar do crescimento de meios digitais. Em seguida, abordamos o cartão de crédito, um instrumento financeiro versátil que oferece conveniência e flexibilidade, mas que também requer um manejo cuidadoso para evitar o endividamento excessivo.",
                "Discutimos a ordem de pagamento e o débito automático, métodos que facilitam a transferência de fundos e o pagamento de contas, promovendo praticidade e garantindo que obrigações financeiras sejam cumpridas em tempo hábil. As transferências bancárias, tanto PIX quanto TED, foram exploradas como opções rápidas e seguras para a movimentação de dinheiro entre contas, destacando as vantagens de cada método.",
                "Os depósitos são um componente fundamental da gestão financeira, permitindo a alocação segura de recursos em contas bancárias, enquanto a conciliação bancária se revelou uma prática indispensável para assegurar a precisão e integridade das transações registradas, prevenindo discrepâncias e fraudes.",
                "Concluímos que o entendimento e a correta utilização dessas ferramentas e práticas são vitais para a eficiência financeira. A rotina bancária, com seus diversos instrumentos, contribui significativamente para a organização e controle das finanças, possibilitando uma gestão mais eficaz e segura dos recursos financeiros."
            ]
        },
        {
            "unidade": [
                "RECAPITULANDO",
                "Querido estudante, chegamos ao fim de uma bela jornada, onde podemos compreender sobre a importância da Contabilidade, e sua representatividade dentro das empresas, através de sua atuação efetiva, fornecendo importante relatórios, que permitem avaliar a situação financeira da empresa.",
                "Também aprendemos sobre a gestão financeira, que através do departamento financeiro, realizamos atividades vitais para o andamento da empresa, onde aliado com as rotinas bancárias, buscamos o melhor resultado financeiro possível.",
                "Espero que tenham gostado deste componente curricular. Até uma próxima!",
                "DO LADO DA CONTABILIDADE BÁSICA SAIRÃO OS SEGUINTES RAMOS:",
                "PRINCÍPIOS",
                "USUÁRIOS",
                "ATIVO",
                "PASSIVO",
                "PATRIMÔNIO LÍQUIDO",
                "ESCRITURAÇÃO CONTÁBIL",
                "PARTIDAS DOBRADAS",
                "",
                "Do outro lado do mapa, de Gestão Financeira, sairão os seguintes ramos:",
                "DEPARTAMENTO FINANCEIRO",
                "COBRANÇA",
                "CONTAS A PAGAR E RECEBER",
                "FLUXO DE CAIXA",
                "ROTINAS BANCÁRIAS",
                "CONCILIAÇÃO BANCÁRIA",
                ""
            ]
        }
    ]
}]