[{
    "secao": "Capítulo 3 – Departamento Financeiro",
    "subsecao": null,
    "unidades": [
        {
            "unidade": [
                "CONTEXTUALIZANDO",
                "Já chegamos no Capítulo 3 do nosso componente curricular. Vamos falar agora de algo super importante para as empresas, mas também de grande importância na nossa vida pessoal, pois também se aplica muito bem ao nosso cotidiano, que são as atividades desenvolvidas no departamento financeiro. Preste atenção, porque tem aprendizado novo:",
                "Neste capítulo, será possível identificar as atividades relacionadas ao crédito empresarial e a cobrança, incluindo conta a receber e a pagar, visando otimizar o fluxo de caixa garantindo a saúde financeira da empresa. Bacana, né? Pois, prepare–se, porque tudo vamos estudar em Departamento financeiro.",
                "#IMAGEM#",
                "Antes de estudar sobre as finanças da empresa, vamos conversar um pouco, sobre as finanças da sua casa. Para isso, responda se, na sua casa, você ou seus responsáveis:",
                "Tem contas a pagar?  _____SIM   ____NÃO",
                "Tem contas/salário a receber?  _____SIM   ____NÃO",
                "Já pegou algum empréstimo?  _____SIM   ____NÃO",
                "Quem que realiza os pagamentos da casa?  ______________",
                "Quem que controla os gastos na sua casa?  _______________",
                "Veja bem, se na sua casa tem várias situações para controlar referente às finanças, imagine então como deve ser em uma empresa, onde tem várias situações ocorrendo durante todo o expediente.",
                "Então, a partir de agora vamos estudar com foco na visão empresarial, mas lembre-se sempre de pensar também no seu dia a dia. Combinado?",
                "#IMAGEM#",
                "",
                "O Departamento financeiro de uma empresa é o setor que trata de todos os assuntos relacionados a finanças, ou seja, é aquela área que cuida do item mais vital para as empresas, o seu dinheiro! Afinal, uma empresa sem dinheiro, vai à falência.",
                "Para entender melhor, vamos pensar na empresa como um corpo humano, o departamento financeiro seria o coração, aquele responsável por fazer o dinheiro circular, para que possa manter todas as outras áreas funcionando bem.",
                "#IMAGEM#",
                "",
                "A função deste departamento é gerenciar as finanças da empresa, ou seja, todos os processos que demandam entradas e saídas de dinheiro. É um setor de grande movimentação de serviços e informações, que deve trabalhar de maneira eficiente de modo a garantir a saúde financeira da empresa.",
                "O gerenciamento deste setor exige do profissional muito planejamento e organização, pois ele precisa ter uma visão geral, de tudo o que acontece dentro da empresa, para assim poder definir metas financeiras de acordo com a real necessidade da empresa. Um bom gestor financeiro não pensa apenas nas responsabilidades e contas do próximo mês, mas também deve ter um pensamento a longo prazo, ou seja, pensar nos próximos anos, garantindo que a empresa tenha estabilidade e segurança para crescer.",
                "Veja como deve ser o perfil do profissional do departamento financeiro:",
                "#IMAGEM#"
            ]
        },
        {
            "unidade": [
                "CONECTANDO",
                "",
                "Podemos trazer um exemplo de uma empresa que é sempre referência em gestão financeira: a Magazine Luiza. Vocês conhecem?",
                "A empresa conseguiu um ótimo crescimento nos últimos anos, devido a uma gestão arrojada e inovadora, e boa parte deste sucesso, é atribuído a sua ótima gestão financeira, que foi bem realizada e, por isso, permitiu ao Magazine Luíza realizar investimentos estratégicos que alavancaram o seu resultado.",
                "Acesse o link abaixo para conhecer um pouco dessa incrível história:",
                "Fonte: https://www.tiktok.com/@historia.artificial/video/7256787782905974021?is_from_webapp=1&sender_device=pc",
                "",
                "#FIQUELIGADO#",
                "Agora, é com você! Faça uma pesquisa na internet sobre uma empresa de sucesso na gestão financeira.",
                "#FIQUELIGADO#",
                "Essas histórias são inspiradoras, não são?",
                "O próximo passo é conhecer algumas atividades rotineiras do setor do departamento financeiro, mas vale a pena te contar, que antigamente estas atividades eram todas executadas no papel e caneta. Mas, agora, as coisas mudaram, e para melhor, concorda? Pois com o avanço da tecnologia, foram desenvolvidos vários programas de gestão financeira, que auxiliam os lançamentos e controles deste setor.",
                "3.1 Crédito",
                "Vamos iniciar este tópico com a definição de Crédito:",
                "Crédito: é uma forma adicional de recursos, que serão obtidos de terceiros (bancos, financeiras, cooperativas de crédito, linhas de crédito do governo, como BNDES (Banco Nacional de Desenvolvimento Econômico e Social), as fintechs e outros) para receber uma quantia específica de dinheiro.",
                "",
                "#SAIBAMAIS#",
                "Você sabe o que são as fintechs?",
                "Talvez ainda não saiba o que é, mas acho que conhece uma, que é queridinha no Brasil.",
                "#SAIBAMAIS#",
                "",
                "Você conhece a Nubank?",
                "A palavra fintech é uma abreviação para financial technology (tecnologia financeira, em português). Essa definição é utilizada para se referir a startups (significa empresa emergente, que está em fase inicial) ou empresas que desenvolvem produtos financeiros totalmente digitais, nestes o uso da tecnologia é o principal diferencial em relação às empresas tradicionais que atuam no setor.",
                "As fintechs podem oferecer as mais diversas soluções, como cartão de crédito, conta digital, cartão de débito, empréstimos, seguros, entre outros. E o melhor, elas conseguem oferecer serviços com diferenciais, como, por exemplo, cartão de crédito sem anuidade.",
                "Entre no site da Nubank e leia mais sobre este assunto:",
                "Link: https://blog.nubank.com.br/fintech–o–que–e/",
                "Numa linguagem mais popular, os créditos, são os empréstimos, que são adquiridos para auxiliar na gestão da empresa, pois possibilitam a aquisição de bens, contratação de serviços, expansão da empresa, quitação de débitos atrasados, melhorias em geral, e vários outras decisões, que vão ser tomadas de acordo com a necessidade de cada empresa."
            ]
        },
        {
            "unidade": [
                "SINTETIZANDO",
                "",
                "Devido a representatividade e importância que tem a concessão de créditos para as empresas, o Sebrae (Serviço Brasileiro de Apoio às Micro e Pequenas Empresas) do RS (Rio Grande do Sul) elaborou uma cartilha, o Crédito para MPEs (Micro e Pequenas Empresas), para ajudar os empresários a tomarem a decisão de fazer um empréstimo, de modo consciente e organizado.",
                "Na cartilha, estão apresentados os seguintes dados:",
                "Banco Central: de acordo com o Banco Central, a concessão de crédito para pequenos negócios cresceu 14% no segundo trimestre de 2022, se comparado ao mesmo período de 2021.",
                "Em termos de número, significa que a quantidade de Brasileiros que buscaram crédito foi de 6,4 milhões para 7,3 milhões.",
                "Para ter acesso ao material completo, acesse o site do Sebrae–RS, e se cadastre: https://ead2lms.SEBRAE.com.br/main/SEBRAErs/Media/view/Modal/862",
                "Pois é, muita gente buscando a concessão de crédito, não é mesmo?",
                "No entanto, preste atenção: antes de buscar um crédito, toda empresa deve se atentar a alguns pontos importantes:",
                "ATENÇÃO ANTES DE ADQUIRIR UM CRÉDITO",
                "TAXAS DE JUROS – Com certeza, esse é o ponto mais importante de ser bem avaliado no momento de buscar um crédito, pois as taxas variam de acordo com o tipo de financiamento e instituição financeira. É preciso verificar o Custo Efetivo Total (CET) para não ter surpresas desagradáveis depois. O CET é o valor final (real) da dívida, considerando todos os encargos e taxas.",
                "PRAZO DE PAGAMENTO – Deve-se avaliar bem o prazo de pagamento, de modo a verificar se a empresa conseguirá honrar com o acordado, os prazos são variados de acordo com cada instituição. Podem existir algumas instituições, que oferecem um tempo de carência, isto é, como um fôlego para começar a pagar depois de um tempo.",
                "GARANTIAS DE EMPRÉSTIMO – Os bancos solicitam garantias como forma de reduzir os riscos da operação, eles seguem critérios próprios e regras do Banco Central. Essas garantias podem ser bens, imóveis, fiança (uma garantia que alguém dá, onde, se a pessoa não cumprir com o combinado, quem deu a fiança se responsabiliza), ou outras.",
                "ANÁLISE E CONCESSÃO DE CRÉDITO – Os bancos e instituições em geral vão fazer avaliações sobre a empresa solicitante do empréstimo, e eles podem considerar algumas situações como: reputação, taxa de rentabilidade, planejamento estratégico da empresa, dentre outros.",
                "3.2 Cobrança",
                "Uma das atividades do departamento financeiro que não é tão boa, digamos assim, é o setor de cobrança. Afinal de contas, quem gosta de cobrar ou ser cobrado? O ideal é que todos honrassem os seus compromissos em dia, não é mesmo? Mas, por diversos fatores, os pagamentos podem atrasar, e então, deve-se entrar em ação o Super-cobrança.",
                "#IMAGEM#",
                "",
                "Cobrança é o ato de solicitar o pagamento de uma dívida.",
                "Em uma empresa, a cobrança é essencial para garantir que todos os clientes paguem o que devem, ajudando a manter o fluxo de dinheiro positivo, de modo a evitar problemas financeiros. Pois, quando uma empresa vende a prazo, ela faz compromissos com aquele valor a receber e por isso assume riscos.",
                "As cobranças podem ser do tipo amigável, judicial ou extrajudicial. Vamos entender um pouco sobre estes tipos:",
                "Cobrança amigável: primeiro vamos cobrar de forma mais tranquila e bem-educada, fazendo abordagens, que podem ser por telefone, e-mails, mensagens, apenas lembrando o cliente do pagamento pendente. Essa abordagem busca manter um relacionamento sadio com o cliente, de modo a não romper a ligação entre empresa e cliente.",
                "Cobrança extrajudicial: aqui a coisa começa a ficar mais séria, pois, se a cobrança amigável não deu certo, vamos partir para a extrajudicial. Essa cobrança envolve terceiros, como advogados ou empresas de cobrança, que tentam novamente negociar o débito, eles abordam o cliente de uma maneira amigável, mas já assumem uma postura mais rígida, utilizando linguagens de protestos, ou ações judiciais.",
                "Cobrança judicial: se a cobrança extrajudicial também não funcionou, aí é hora do bicho pegar, devemos partir para um método mais agressivo, que é a cobrança judicial. Nesse caso, a empresa deve recorrer ao poder judiciário para recuperar o valor devido. Esse processo na justiça pode custar caro para a empresa, que terá custos para resolver o problema, como a contratação de um advogado, além do desgaste na relação com o cliente.",
                "Pois bem, como já falamos acima, cobrar não é nada fácil, e não é umas das tarefas mais agradáveis dentro de uma empresa, por isso, para realizar esta tarefa, a CDL (Câmara de Dirigentes Lojistas) de São Paulo apresenta algumas técnicas de cobrança, que podem auxiliar o cobrador e trazer resultados positivos:",
                "1 – Seja empático com o seu cliente: buscar entender o que o cliente está passando, faz com que ele se sinta importante para sua empresa, e perceba que você está tentando ajudá–lo a solucionar um problema.",
                "2 – Não seja invasivo: atenção na sua abordagem, ela deve ser cautelosa, envie mensagens primeiro, aguarde o cliente responder, e deixe as ligações para o momento correto.",
                "3 – Prepare–se para cobrar: antes de efetuar a cobrança, estude todo o cenário possível, para aquele cliente, como as propostas, informações sobre a dívida, isto vai transparecer mais confiança e competência.",
                "4 – Fique atento: constranger não é uma opção (nunca). Mantenha sempre a cordialidade e a educação, para que a conversa aconteça de maneira mais calma, clara e objetiva. Pense sempre que perder a calma e constranger esse cliente não irá ajudar em nada.",
                "5 – Mantenha a postura e não leve nada para o pessoal: às vezes o cliente pode resolver descontar todos os problemas dele em cima de você. Neste caso, mantenha-se sereno, e não leve nenhuma situação para o lado pessoal, lembre-se de que negócios são negócios.",
                "6 – Conte com promoções e descontos: negocie com seu cliente, ofereça descontos nos juros ou elabore alguma promoção para quitação da dívida, desperte nele, o desejo de pagar de uma maneira diferenciada.",
                "7 – Converse sobre o que ele vai perder: as pessoas não gostam de perder oportunidades, então é uma das melhores técnicas para convencer um cliente inadimplente a quitar o seu débito.",
                "8 – Diga o que ele ganha quitando a dívida: você também pode mostrar de maneira clara o que ele vai ganhar pagando, como descontos especiais, flexibilidade na data para pagamento, sempre focando nos benefícios que ele terá.",
                "9 – Demonstre os seus meios de recebimento/pagamento: ofereça vários meios de pagamentos, tipo, boletos, QR CODE, PIX, ir em lotéricas, cartão de crédito ou débito, ou outros.",
                "10 – Esteja pronto para responder qualquer pergunta: se prepare para ter todas as respostas na ‘ponta-da-língua’, pois existem clientes de vários perfis.",
                "#FIQUELIGADO#",
                "Para acessar o material completo da CDL (Câmara de Dirigentes Lojistas) de São Paulo, acesse o link abaixo:",
                "https://cdlsp.com.br/blog/as–melhores–tecnicas–para–cobrar–um–cliente/",
                "#FIQUELIGADO#",
                "3.3 Conta a receber",
                "Estamos caminhando no departamento financeiro, agora vamos conhecer a atividade de Contas a receber:",
                "Contas a receber: são valores que a empresa tem que receber de seus clientes, referentes a vendas ou serviços prestados, que tiveram os seus pagamentos negociados a prazo.",
                "A principal função do setor de contas a receber é garantir que a empresa tenha recursos financeiros entrando no caixa, de modo que tenham dinheiro para pagar suas despesas e manter o negócio funcionando.",
                "Para garantir este movimento é necessário fazer um gerenciamento eficaz das contas a receber, acompanhando os prazos de pagamento, e quando necessário, atuar junto com o setor de cobranças, para redução da inadimplência.",
                "Um sistema de gestão financeira auxilia muito no controle, pois nele registra todas as contas a receber, bem como suas datas de vencimento, sendo possível gerar relatórios que direcionam o setor financeiro nas tomadas de decisão.",
                "COMO ORGANIZAR AS CONTAS A RECEBER?",
                "Uma forma bem prática é separar as contas a receber em categorias, como:",
                "– A receber no curto prazo: contas com vencimentos de até 30 dias",
                "– A receber no médio prazo: vencimento entre 30 e 90 dias.",
                "– A receber em atraso: contas que já passaram do prazo e exigem atenção especial.",
                "Lembra do nosso Balanço Patrimonial? Pois é, as contas a receber são registradas nele, na parte dos Ativos. Você lembra o que é um Ativo? É tudo o que a empresa possui ou tem o direito de receber.",
                "Agora, me segue, vamos para o “Exercitando”!"
            ]
        },
        {
            "unidade": [
                "EXERCITANDO",
                "",
                "Questão 1",
                "Analise a situação apresentada abaixo:",
                "Situação: o Supermercado Preço Bão, tem uma freguesia mais antiga, e ele ainda faz notinhas de vendas a prazo, ou seja, ele tem contas a receber. As notinhas dele estão uma bagunça e precisam ser organizadas. Considere que você está trabalhando no departamento financeiro deste supermercado, e por isso irá ajudá–lo nesta tarefa!",
                "Abaixo está a listagem das vendas a prazo:",
                "1. Cliente A – R$ 500,00 – vencimento: 15/nov/2024",
                "2. Cliente B – R$ 300,00 – vencimento: 05/nov/2024",
                "3. Cliente C – R$ 800,00 – vencimento: 20/nov/2024",
                "4. Cliente D – R$ 200,00 – vencimento: 25/dez/2024",
                "5. Cliente E – R$ 600,00 – vencimento: 01/out/2024",
                "6. Cliente F – R$ 400,00 – vencimento: 10/dez/2024",
                "7. Cliente G – R$ 1 000,00 – vencimento: 15/set/2024",
                "8. Cliente H – R$ 700,00 – vencimento: 20/nov/2024",
                "9. Cliente I – R$ 350,00 – vencimento: 02/nov/2024",
                "10. Cliente J – R$ 900,00 – vencimento: 15/jan/2025",
                "Organize as contas a receber, separando por categorias de curto prazo, médio prazo e as atrasadas. Considere que você está fazendo esta análise em 01/nov/2024.",
                "Curto prazo: vencimento até 30 dias a partir de 01/nov/2024.",
                "Médio prazo**: vencimento entre 30 e 90 dias a partir de 01/nov/2024.",
                "Atrasadas: vencimentos antes de 01/nov/2024.",
                "Contas a receber: médio Prazo – (vencimento entre 30 e 90 dias – 01/dez/2024 a 30/jan/2025)",
                "",
                "Contas a receber: atrasadas – (vencimentos antes de 01/nov/2024)"
            ]
        },
        {
            "unidade": [
                "PRATICANDO",
                "3.4 Contas a pagar",
                "Cara, falar de contas a receber é muito bom...",
                "Mas como a vida, tem também suas preocupações, vamos ter que falar também de contas a pagar.",
                "#IMAGEM#",
                "Pois é, para ter uma empresa funcionando, são geradas muitas contas a pagar, e é sobre isso que vamos falar agora:",
                "Contas a pagar: são valores que a empresa tem que pagar a terceiros, que podem ser funcionários, aluguel, energia etc....",
                "A principal função do setor de contas a pagar é registrar todas as obrigações da empresa que deverão ser liquidadas num determinado período, conforme o acordado. Atualmente, em boa parte das empresas este registro e controle são feitos em sistemas. Mas ainda existem aqueles empreendedores que não possuem sistemas, então, seus controles podem ser manuais ou eletrônicos, através, por exemplo, do Excel, que também é uma ótima ferramenta. O Importante é controlar independente de qual seja o meio utilizado!",
                "Obrigações do Contas a pagar:",
                "– Pagar as contas em dia.",
                "– Negociar com os fornecedores, quando necessário.",
                "– Priorizar os pagamentos de acordo com benefícios ou incentivos.",
                "– Planejar o orçamento mensalmente.",
                "O Contas a pagar deve ter um controle das contas que são fixas, ou seja, aquelas que ocorrem todo mês, pois elas merecem uma atenção especial, e não devem ser atrasadas ou negociadas.",
                "Além das contas fixas, temos também as contas variáveis, que aí nem sempre é possível prever o consumo antes, então é interessante sempre ter reservas financeiras, para não assustar com as variáveis:",
                "#IMAGEM#",
                "Agora, um desafio!",
                "Responda, onde é que lá no Balanço Patrimonial, as contas a pagar serão registradas?",
                "3.5 Fluxo de Caixa",
                "Observe que até aqui, falamos de dinheiro que vem, e dinheiro que vai, não é mesmo? Um enorme fluxo de dinheiro, como uma estrada, com movimento constante. E para saber para onde está indo o dinheiro, precisamos entender como está este movimento.",
                "#IMAGEM#",
                "Para entender esse vai e vem de dinheiro, vamos estudar uma ferramenta muito boa para visualizar tudo o que está acontecendo, tipo como vemos em uma fotografia. É o Fluxo de Caixa, na qual são registradas todas as saídas e entradas de dinheiro da empresa, dia após dia, semana após semana, mês após mês....",
                "#ATENCAO#",
                "Você, consegue registrar, durante os últimos 7 dias, tudo o que você gastou e tudo o que você recebeu? Vamos tentar lembrar? Anote, tudo, mesmo uma simples bala.",
                "#ATENCAO#",
                "#IMAGEM#",
                "E aí, foi fácil ou difícil lembrar os gastos dos últimos 7 dias?",
                "(  ) Fácil",
                "(  ) Difícil",
                "Pois é, nem sempre é fácil recordar, afinal, a vida é uma correria, com um monte de coisas para fazer e muita informação o tempo todo. É como se o nosso cérebro fosse colocando uma informação sobre a outra, e então, substituindo.",
                "Se em nossa vida é assim, um enorme fluxo de acontecimentos, agora imagine isso dentro de uma empresa, quem tem contas a receber e contas a pagar entrando e saindo o tempo todo? Por isso, para não perder nenhuma informação importante, se faz necessário os registros de fluxo de caixa diariamente, de maneira organizada e sistemática, garantindo uma fotografia real da situação do caixa da empresa no instante verificado.",
                "Se houver a necessidade de um gasto emergencial, onde o pagamento só pode ser realizado, à vista, basta olhar o fluxo de caixa, que será possível verificar se tem dinheiro para poder realizar este pagamento.",
                "Fluxo de Caixa: controle da movimentação de dinheiro de uma empresa, com registros de dinheiro gasto ou recebido, em um período determinado, podendo ser uma semana, ou um mês.",
                "Cara, é muito importante saber como e com o que, se gasta o dinheiro, porque isso direciona os gastos, sendo possível identificar para onde o dinheiro está indo!",
                "O fluxo de caixa de uma empresa será elaborado de acordo com o nível de complexidade de atuação daquela empresa, por exemplo, o fluxo de caixa da loja de roupas da Virgínia será diferente do fluxo de caixa da Multinacional Maranhão. Basta imaginar assim: a loja dela só vende vestuário, então, a movimentação de descrição de itens é mais fácil de gerenciar, do que da multinacional, que possui vários itens diferentes e vários gastos e receitas.",
                "No fluxo de caixa deve conter no mínimo as seguintes informações:",
                "#IMAGEM#",
                "Período analisado: se refere ao mês e ano.",
                "Data da movimentação: é o dia da movimentação, onde podem ocorrer várias movimentações em um mesmo dia, ou pode acontecer de que em determinados dias, não ocorra nenhuma movimentação.",
                "Descrição da movimentação: identificar a origem da entrada ou saída.",
                "Entradas: valor em reais que entrou no caixa.",
                "Saídas: valor em reais que saiu do caixa.",
                "Saldo final: este saldo representa o valor que a empresa possui no fim do dia, que será o mesmo, que ela iniciará no dia seguinte.",
                "Saldo final: Saldo do dia anterior (+) entrada do dia (–) saída do dia",
                "Para calcular o saldo final do dia a dia, a conta é a seguinte:",
                "",
                "Já sabemos que, quando se trata de números, a melhor maneira de aprender é ir para a prática. Então vamos lá!",
                "",
                "#IMAGEM#",
                "Gui e João são amigos desde o tempo da escola, e agora se tornaram sócios. Eles abriram um negócio de foodtruck de hambúrgueres gourmet, chamado Burguer Brothers.",
                "O negócio deles está bombando, pois tem uma pegada inovadora. Eles são criativos e capricham no sabor!",
                "Nas vendas está indo tudo muito bem, mas os jovens precisam também controlar as despesas, para que de fato possam saber como estão os resultados do foodtruck.",
                "Para isso, eles estão utilizando o fluxo de caixa.",
                "Vamos acompanhar o movimento financeiro deles durante um mês.",
                "#IMAGEM#",
                "Analisando o fluxo de caixa acima, podemos fazer este resumo do mês:",
                "Saldo inicial: R$ 2 000,00",
                "Entradas totais: R$ 9 500,00",
                "Saídas totais: R$ 6 800,00",
                "Saldo final: R$ 4 700,00",
                "Os jovens ficaram muito satisfeitos com o resultado apresentado no mês de janeiro, pois, de acordo com o fluxo de caixa, eles tiveram um LUCRO de R$ 4 700,00. Isso é muito bom, principalmente, para quem está iniciando.",
                "O fluxo de caixa permite avaliar como o negócio está indo, se está bem, mal ou se precisa de ajustes. Ter um resultado positivo é ótimo, mas o empreendedor deve sempre observar onde é possível economizar ou investir para melhorar.",
                "#CURIOSIDADE#",
                "Você sabia, que os empreendedores de pequenos negócios são os grandes protagonistas da economia do Maranhão?",
                "#CURIOSIDADE#",
                "Veja este dado: 95% das empresas ativas no Maranhão são MEI (Micro Empreendedor Individual ou MPE (Micro e Pequena Empresa).",
                "Abaixo está o link da matéria completa, no site do Sebrae. Vale a pena conferir! Quem sabe você também irá fazer parte destes dados!",
                "Link: https://ma.agenciaSEBRAE.com.br/cultura–empreendedora/empreendedores–de–pequenos–negocios–sao–os–grandes–protagonistas–da–economia–maranhense/",
                "Depois dests prática ficou fácil de compreender a importância de um fluxo de caixa bem-feito, não ficou? Ensine ele para alguém que você conheça, pode ser uma pessoa para gerir as contas do pessoal, ou para algum comércio, como o Sr. Manoel do Bar da Esquina. O fluxo de caixa é uma ferramenta útil para todos.",
                "Ei, lembra das contas a receber e das contas a pagar que vimos acima, pois é, para controlar o fluxo de caixa é muito importante saber as informações contidas neles, porque aí ao lançar os dados no fluxo de caixa não teremos grandes surpresas, apenas aqueles gastos emergenciais.",
                "Dicas para um bom controle de fluxo de caixa:",
                "– Atenção nos registros",
                "– Planeje as saídas",
                "– Controle os recebimentos",
                "– Controle os pagamentos",
                "– Tenha organização",
                "– Faça um fluxo de fácil de analisar",
                "Então, é isso aí, se você ficar atento a essas dicas, será um ótimo controlador de fluxo de caixa.",
                "Agora, é a hora de gravar esse conteúdo na mente! Bora fixar direitinho, através do “Exercitando”, para não esquecer depois",
                "Questão 1",
                "Relacione a primeira coluna de acordo com a segunda coluna:",
                "(1) Crédito",
                "(2) Cobrança",
                "(3) Contas a receber",
                "(4) Contas a pagar",
                "(5) Fluxo de Caixa",
                "(  ) são valores que a empresa tem que receber de seus clientes, referentes a vendas ou serviços prestados",
                "( ) são valores que a empresa tem que pagar a terceiros, que podem ser funcionários, aluguel, energia etc...",
                "( ) é uma forma adicional de recursos, que serão obtidos de terceiros (empréstimo).",
                "( ) controle da movimentação de dinheiro de uma empresa, com registros de dinheiro gasto ou recebido",
                "(  ) é o ato de solicitar o pagamento de uma dívida.",
                "",
                "Questão 2",
                "Resolva o problema de fluxo de caixa baixo:",
                "Situação:",
                "A Tina e Bia são amigas desde a infância, sempre gostaram de moda, e juntas abriram a loja “Toda Bela”. São ótimas em moda, estão sempre atentas sobre quais são as novidades da estação, e por isso a loja está vendendo bem. Mas são inexperientes em controles financeiros. Por isso não sabem se no final do mês, de fato se estão tendo lucro ou prejuízo.",
                "Sua missão é ajudar elas a montar o fluxo de caixa da loja, no mês de outubro/24.",
                "Abaixo está tudo o que elas registraram:",
                "1. Dia 01: venda de roupas à vista – Valor: R$ 3 500,00 – (Entrada).",
                "2. Dia 05: pagamento do aluguel da loja – Valor: R$ 1 200,00 – (Saída).",
                "3. Dia 08: venda de roupas à vista – Valor: R$ 2 000,00 – (Entrada).",
                "4. Dia 10: compra de mercadorias para reposição – Valor: R$ 1 800,00 – (Saída).",
                "5. Dia 12: pagamento da conta de energia elétrica – Valor: R$ 350,00 – (Saída).",
                "6. Dia 15: venda no Pix – Valor: R$ 1 200,00 – (Entrada).",
                "7. Dia 18: pagamento dos salários dos funcionários – Valor: R$ 2 500,00 – (Saída).",
                "8. Dia 20: recebimento de uma venda parcelada do mês passado – Valor: R$ 1 000,00 –(Entrada).",
                "9. Dia 25: pagamento do fornecedor – Valor: R$ 900,00 – (Saída).",
                "10. Dia 30: venda no cartão de débito – Valor: R$ 2 500,00 – (Entrada).",
                "Obs.: o saldo delas no início o mês estava zerado.",
                "Agora, faça os lançamentos no fluxo de caixa, e avalie se o saldo, foi positivo ou negativo:",
                "#IMAGEM#",
                "3 – Encontre as palavras abaixo, no caça–palavras:",
                "",
                "Crédito",
                "Cobrança",
                "Contas a receber",
                "Contas a pagar",
                "Fluxo de Caixa",
                "",
                "CAÇA PALAVRAS",
                ""
            ]
        },
        {
            "unidade": [
                "RECAPITULANDO",
                "Neste capítulo, exploramos o Departamento Financeiro, abordando os principais conceitos e suas interrelações fundamentais para a gestão eficiente das finanças empresariais. O funcionamento harmônico destes elementos é crucial para a saúde financeira e o sucesso a longo prazo de qualquer organização.",
                "Crédito é a confiança que permite a uma empresa obter bens ou serviços imediatamente e pagar posteriormente. O gerenciamento adequado do crédito é essencial para assegurar que a empresa mantenha uma boa reputação financeira e condições favoráveis para futuras negociações.",
                "Cobrança refere-se às estratégias e processos adotados para garantir que os pagamentos devidos à empresa sejam recebidos dentro dos prazos acordados. A eficiência na cobrança é vital para manter o fluxo de caixa saudável e evitar problemas de liquidez.",
                "Contas a Receber são os valores devidos pelos clientes à empresa por serviços ou produtos fornecidos. É fundamental monitorar esses valores de perto para garantir que os pagamentos sejam recebidos de forma oportuna e que a empresa tenha os recursos necessários para suas operações diárias.",
                "Contas a Pagar representam as obrigações financeiras da empresa com fornecedores e credores. A administração eficaz das contas a pagar ajuda a manter um bom relacionamento com os fornecedores, evitando atrasos nos pagamentos e possíveis interrupções no fornecimento de materiais essenciais.",
                "O Fluxo de Caixa é o movimento de entrada e saída de dinheiro da empresa. Ele reflete a capacidade da organização de gerar recursos suficientes para cobrir suas despesas operacionais e investir em crescimento. Um fluxo de caixa bem gerido garante que a empresa possa enfrentar imprevistos e aproveitar oportunidades de mercado.",
                "Em resumo, o Departamento Financeiro desempenha um papel central na sustentação e crescimento de uma empresa. Os conceitos de crédito, cobrança, contas a receber, contas a pagar e fluxo de caixa estão interligados, e sua gestão integrada é necessária para garantir a estabilidade financeira e a viabilidade econômica da empresa.",
                "#IMAGEM#",
                "#Capítulo#"
            ]
        }
    ]
}]