[{
    "secao": "Capítulo 2 – Escrituração Contábil",
    "subsecao": null,
    "unidades": [
        {
            "unidade": [
                "CONTEXTUALIZANDO",
                "Olá,  estudante! Neste capítulo vamos abordar o tema da Escrituração Contábil, que o diário secreto da empresa, onde ela anota tudo. Vamos dar mais um passo importante nesta caminhada dentro do mundo da Contabilidade.Primeiramente, vamos entender o que significa a palavra escriturar:",
                "Escriturar: anotar de maneira organizada, sistemática (contas comerciais); fazer a escrituração de.",
                "Já deu para ter uma ideia do que se trata: anotar tudo o que acontece na Contabilidade. A Escrituração Contábil é o processo de registrar, de forma organizada e cronológica (sequência no tempo), todas as transações financeiras e econômicas de uma empresa. Esses registros são realizados em documentos chamados de livros contábeis.",
                "Para que a Escrituração Contábil seja feita corretamente, cada operação deve ser lançada detalhadamente, incluindo data, valor, conta envolvida e uma descrição que explique o contexto da transação financeira. Por meio da escrituração, é possível monitorar entradas e saídas de recursos, identificar lucros e prejuízos, obtendo, assim, uma visão clara da situação financeira da empresa.",
                "#IMAGEM#",
                "Lembra que falamos que os registros contábeis já foram feitos em blocos de argila? Pois é, já no Egito Antigo, as coisas melhoraram um pouco, e os registros eram feitos em papiros. Digamos que era uma folha feita de modo artesanal. Os registros eram todos feitos à mão! Já imaginou se você vivesse nessa época?",
                "Com a evolução do tempo, o trabalho de Contabilidade foi se estruturando, e surgiram normas e princípios para nortear a atividade, de modo que todo profissional atue de maneira responsável e ética, buscando atender às exigências do setor contábil. Por isso, no Brasil, existe uma legislação que regulamenta os livros contábeis e as práticas contábeis, podemos citar os principais, são eles:",
                "Código Civil Brasileiro: Lei nº 10.406/2002, especialmente os artigos 1.179 a 1.195;",
                "Lei das Sociedades por Ações: Lei nº 6.404/1976;",
                "Regulamento do Imposto de Renda (RIR);",
                "Normas do Conselho Federal da Contabilidade (CFC)."
            ]
        },
        {
            "unidade": [
                "CONECTANDO",
                "",
                "Agora, vamos parar e pensar um pouquinho:",
                "#IMAGEM#",
                "Imagine a movimentação financeira de um grupo como o Magazine Luiza. O que você acha? São gerados muitos ou poucos registros contábeis?",
                "Para se ter ideia do tamanho da relação dos registros, acesse abaixo o link das Demonstrações Financeiras de 31 de dezembro de 2023 e 2022.",
                "Link: https://ri.magazineluiza.com.br/ListResultados/Download.aspx?Arquivo=m4+3Hf24hD8w4AZnpHdpHg== Demais, né? A perder de vista! E então, como esses registros contábeis são realizados?Como já sabemos, antigamente não existiam computadores. Então tudo era feito na mão mesmo, muito registro e muito papel, com muita burocracia. Mas, você teve sorte, e nasceu na era da tecnologia! E agora esses registros contábeis podem ser realizados de forma física (no papel) ou em meio eletrônico, através de um Sistema Público de Escrituração Digital (SPED), que é um site oficial controlado pelo governo brasileiro.",
                "O site do SPED é onde as empresas registram as informações contábeis e fiscais de forma digital, ao invés de ficar jogando um monte de papel para o governo. É como se fosse uma versão super organizada, online e sem desperdício de papel. Isso é bom, né?",
                "",
                "#IMAGEM#",
                "2.1 Plano de Contas – Classificação e Função das Contas",
                "",
                "Para organizar a maneira como será realizada toda a Escrituração Contábil, temos então uma ferramenta que se chama Plano de Contas, que é uma espécie de mapa que norteia todos os lançamentos contábeis. Imagine que você está organizando o orçamento de uma festa com seus amigos, e para entender melhor todos os gastos, eles serão separados por tipos de despesas, como comida, bebidas, decoração etc. Como no quadro abaixo:",
                "#IMAGEM#",
                "Observe que demos tópicos principais para os títulos, e tópicos secundários para os subtítulos. É o que o Plano de Contas organiza na Contabilidade, porém ele vai utilizar os termos contábeis correspondentes. Então, as contas são divididas em alguns grupos principais, onde cada grupo tem uma classificação e função específicas.",
                "Vamos explorar esses grupos juntos?",
                "As contas podem ser classificadas de acordo com vários critérios, conforme a demanda de cada empresa. Porém, vamos ressaltar aqueles mais importantes e por isso são os que mais nos interessam (Ribeiro, 1999). Eles são classificados em dois grupos:",
                "Contas Patrimoniais: notícia boa! Essas contas você já conhece. Lembra quais são?",
                "Vamos juntos:",
                "elas são: Bens, Direitos, Obrigações e Patrimônio Líquido;",
                "se dividem em: Ativos e Passivos.",
                "#IMAGEM#",
                "Contas de Resultado: essa você ainda não conhece, mas logo vai perceber que ela é familiar também ao seu dia a dia. Porque elas são compostas de receitas e despesas. Sendo receitas as entradas de dinheiro, através de vendas de bens ou prestação de serviços, que aumentam o valor do patrimônio da empresa. E as despesas são, os gastos necessários para que a empresa funcione.",
                "Para ficar mais fácil, vamos ver alguns exemplos de receitas e despesas:",
                "#IMAGEM#",
                "Geralmente as receitas são em menor quantidade de descrição do que as despesas:",
                "#IMAGEM#",
                "As despesas são muitas, e por isso precisam ser muito bem gerenciadas e controladas, porque senão elas consomem todo o dinheiro da empresa.",
                "#ATENCAO#",
                "E na sua casa, as receitas e despesas estão sob controle?",
                "Lá tem mais receitas ou mais despesas?",
                "#ATENCAO#",
                "Registre abaixo as despesas e receitas de sua casa:",
                "#IMAGEM#",
                "Cada tipo de conta apresentado tem uma função específica, conforme apresentado na tabela abaixo:",
                "#IMAGEM#",
                "Vamos passar para o próximo tópico, onde vamos aprofundar ainda mais no conhecimento contábil.",
                "2.2 DemonstrAtivos Contábeis",
                "",
                "Se liga, nesta! Nós já falamos da Escrituração Contábil, deste ato importante de registrar de maneira organizada, aí definimos o plano de conta e como ele deve também ser ordenado, agora vamos conhecer na prática alguns controles contábeis, onde vamos perceber a aplicação dos termos que estudamos até aqui.",
                "Estes controles, são os Demonstrativos Contábeis, que podem também serem chamados de demonstrações financeiras, eles são relatórios que mostram a situação financeira e o desempenho de uma empresa, num determinado período. Podemos dizer que eles são como um Raio–X da empresa, que mostram a realidade como está por “dentro” da empresa.",
                "",
                "#IMAGEM#",
                "Após a análise e interpretação desses Demonstrativos Contábeis, os gestores e investidores podem tomar decisões assertivas sobre o futuro da empresa, eles são também como uma bússola, que orienta qual direção tomar. Por exemplo, se um supermercado está com bons resultados eles podem auxiliar na decisão de abrir uma filial. Mas, se os resultados apresentados estiverem ruins, talvez seja a hora de rever como está sendo a administração, identificar os possíveis erros e buscar solucionar, visando evitar a falência daquele supermercado.",
                "#CURIOSIDADE#",
                "Sabia que o Sebrae calcula a taxa de sobrevivência das empresas no Brasil?",
                "E os números são preocupantes! Pois ainda é grande o número de empresas que não conseguem sobreviver! E uma das causas é que os empreendedores não sabem fazer os registros contábeis e financeiros de suas empresas, e nem tão pouco sabem analisar os números!",
                "#CURIOSIDADE#",
                "Isso, evidencia a importância de saber fazer a Escrituração Contábil bem direitinho!",
                "Veja só, como estes números são altos!",
                "Entre as empresas fechadas em 2020, verificou–se que, após 05 anos de atividade:",
                "Os MEIs (Microempreendedores Individuais) têm a maior taxa de mortalidade entre os Pequenos Negócios, 29% fecham.",
                "Já as MEs (MicroEmpresas) têm taxa de mortalidade intermediária entre os Pequenos Negócios, 21,6% fecham.",
                "As EPPs (Empresa de Pequeno Porte) têm a menor taxa de mortalidade entre os Pequenos Negócios, 17% fecham.",
                "A maior taxa de mortalidade é verificada no comércio (30,2% fecham em 5 anos) e a menor na indústria extrativa (14,3% fecham em 5 anos).Aqui está o link da pesquisa:",
                "Fonte:",
                "https://SEBRAE.com.br/sites/PortalSEBRAE/artigos/a–taxa–de–sobrevivencia–das–empresas–no–Brasil,d5147a3a415f5810VgnVCM1000001b00320aRCRD#:~:text=As%20EPPs%20t%C3%AAm%20a%20menor,%25%20fecham%20em%205%20anos",
                "Continuando a observar os Demonstrativos Contábeis e sua importância e representatividade, abaixo segue um spoiler dos nomes dos registros que vamos compreender neste Capítulo 2:",
                "Balanço Patrimonial;",
                "Balancete de Verificação;",
                "Livro Diário;",
                "Livro Razão;",
                "Demonstrativo de Resultado e Exercício (DRE).",
                "",
                "Agora vamos lá conhecer cada um desses registros!",
                "2.2.1 Balanço Patrimonial",
                "Aqui, vamos relembrar um pouco do que vimos lá no tópico 1.3 Patrimônio.O Balanço Patrimonial é o mais importante relatório gerado pela Contabilidade, pois a partir dele é possível analisar e identificar como está a saúde financeira e econômica da empresa, podendo ser avaliado no fim do ano, ou num período estabelecido (Marion, 2009).Nós já fizemos uma parte importante do Balanço Patrimonial, que foi aquela representação gráfica, que nos ensina o lado que deve ser colocado os Ativos, Passivos e Patrimônio Líquido. Vamos relembrar juntos?",
                "#IMAGEM#",
                "",
                "Pois bem, por convenção, estabeleceu-se que, do lado esquerdo, devem ser lançados os Ativos e do lado direito os Passivos, incluindo também o Patrimônio Líquido.Agora vamos aprender que o Patrimônio Líquido é composto pelos seguintes elementos:",
                "Capital;",
                "Reservas;",
                "Lucros ou Prejuízos acumulados.",
                "",
                "Sendo que o capital, é a principal fonte do grupo do Patrimônio Líquido, pois é o valor que foi investido para criar a empresa. Enquanto as reservas se referem a parte do lucro que poderá ser retirada para algum investimento na empresa. E, por fim, o lucro é o fim desejado de toda empresa. Já os prejuízos são aquela parte ruim, que ninguém quer.No Balanço Patrimonial, as somas do lado dos Ativos devem sempre ser iguais ao lado do Passivo, dando a ideia de uma balança equilibrada.",
                "#IMAGEM#",
                "#SAIBAMAIS#",
                "Descrição: Para que as atividades contábeis sejam estruturadas e não haja divergência de interpretações, existem Leis que regulamentam certas atividades.A Lei nº 6.404/76 é a lei que direciona os principais registros contábeis que são obrigatórios para uma empresa. Abaixo tem um vídeo sobre aplicação desta Lei na Contabilidade. Vídeo: Contabilidade na Lei 6.404/1976",
                "https://www.youtube.com/watch?v=nTlqigHhmWU",
                "#SAIBAMAIS#",
                "Agora vamos traduzir tudo isso em números, para ficar mais fácil o entendimento e aplicação, onde vamos acompanhar a formação de uma empresa comercial com algumas movimentações que vão formar o Balanço Patrimonial.",
                "Vamos ver um Balanço Patrimonial na prática!"
            ]
        },
        {
            "unidade": [
                "PRATICANDO",
                "",
                "Alice Castro é uma jovem de 18 anos, com um perfil de empreendedora. Ela sempre sonhou ser dona do próprio negócio. Legal, né? Ela é como o João, você se lembra dele?",
                "Muito bem, se você também tem esse perfil de empreender, vamos acompanhar a Alice Castro, que vai te ajudar a planejar o seu negócio. Ela é apaixonada por tecnologia e já sabe que o mercado é potencial, e por isso abriu uma loja de eletrônicos.",
                "Ela possui um capital de R$ 50 000,00.",
                "Passo 1: vamos representar o capital da Alice neste momento. Atente-se que ela está iniciando as atividades com R$ 50 000,00 em dinheiro, que é um Bem, e portanto, é um Ativo, que será representado como Caixa.",
                "Mas este valor também faz parte do Patrimônio Líquido, como Capital, e neste caso, ele deve ser lançado no lado Passivo. De modo que iguale o Ativo e Passivo. Vamos lá?",
                "",
                "#IMAGEM#",
                "Passo 2 – Em seguida, Alice Castro irá aplicar este capital na compra de bens, sendo:",
                "Compra de móveis e utensílios, à vista: R$ 5 000,00",
                "Compra de mercadorias, à vista: R$30 000,00",
                "Após essas compras, vamos ver o que aconteceu no patrimônio:",
                "No caixa, tinha R$ 50 000,00 e ela retirou R$ 35 000,00, portanto, restaram R$ 15 000,00 no caixa. Agora as duas compras realizadas vão aparecer no Ativo também, vamos construir o Balanço Patrimonial?",
                "#IMAGEM#",
                "Observe que houve movimentações no balanço, porém, o seu valor total não alterou, houve apenas alterações no Ativo. No lado do Passivo, não houve nenhuma movimentação, portanto, manteve somente o lançamento do Capital, de modo que os lados da balança estão equilibrados, ou seja, ATIVO igual PASSIVO.",
                "",
                "Passo 3: Alice Castro percebeu a necessidade de aquisição de mais bens para a sua loja, porém, surgiu um problema... o seu dinheiro em caixa não é suficiente, por isso ela terá que comprar a prazo.",
                "Ela vai comprar um automóvel, para utilizar para resolver as situações da loja com mais rapidez, no valor de R$ 20 000,00, parcelados em 4x de R$ 5 000,00.Note que, quando uma empresa compra a prazo, ela passa a trabalhar com obrigações a cumprir, ou seja, pagamentos a efetuar. Isso irá gerar entrada no Ativo, e no Passivo, vamos ver como vai ficar:",
                "",
                "#IMAGEM#",
                "Passo 4: ao final do mês, Alice Castro realizou o pagamento da primeira prestação do automóvel, no valor de R$ 5 000,00. Para isso, ela retirou do caixa este valor, reduzindo o seu dinheiro em caixa, que está no Ativo. Se mexeu no Ativo, também deve mexer no Passivo, de modo a garantir o equilíbrio. SEMPRE LEMBRE DISSO!Vamos ver como ficará o Balanço Patrimonial?",
                "#IMAGEM#",
                "Vamos parar o exemplo da Alice Castro por aqui. Viu como foi bacana acompanhar os lançamentos e ver os movimentos dentro do Balanço Patrimonial? Lembre–se sempre que cada movimentação financeira modifica o seu patrimônio, apresentando uma nova situação patrimonial.",
                "",
                "Agora é hora de testar o seu conhecimento, então, resolva o exercício abaixo:"
            ]
        },
        {
            "unidade": [
                "EXERCITANDO",
                "Questão 1",
                "Quais são os elementos que compõem o Balanço Patrimonial?",
                "Questão 2",
                "Assinale a segunda coluna de acordo com a primeiro coluna:",
                "(1)Ativos",
                "(2)Passivos",
                "(  ) Duplicatas a receber",
                "(  ) Salários a pagar",
                "(  ) Estoque de mercadorias",
                "(  ) Veículos",
                "(  ) Imóvel",
                "(  ) Impostos a pagar",
                "(  ) Móveis e utensílios",
                "(  ) Duplicatas a pagar",
                "(  ) Caixa (dinheiro)",
                "",
                "Questão 3",
                "Monte o Balanço Patrimonial, para a situação apresentada abaixo:",
                "LEMBRE–SE SEMPRE DE QUE OS LADOS DO BALANÇO DEVEM SER IGUAIS.",
                "Situação:",
                "A Loja de Brinquedos Criança Feliz, começou as suas operações com:",
                "1 – Investimento inicial de: R$ 50 000,00",
                "2 – Compra de mercadorias para revenda: no valor de R$ 30 000, 00 (sendo que R$ 10 000,00 foram à vista e o restante R$ 20 000,00 será pago a prazo, em boletos).",
                "3 – Compra de móveis e equipamentos (à vista): R$ 5 000,00",
                "4 – Empréstimo bancário, para ajudar nas operações: R$ 15 000,00",
                "",
                "Faça os lançamentos no Balanço Patrimonial:",
                "Questão 4",
                "Monte o Balanço Patrimonial, para a situação apresentada abaixo:",
                "LEMBRE–SE SEMPRE DE QUE OS LADOS DO BALANÇO DEVEM SER IGUAIS.",
                "Situação:",
                "A Padaria Sonho de Pão, começou as suas operações com:",
                "1 – Investimento inicial de: R$ 100 000,00",
                "2 – Compra de mercadorias para revenda: no valor de R$ 20 000, 00 (sendo que R$ 10 000,00 foram à vista e o restante R$ 10 000,00 será pago a prazo, em boletos).",
                "3 – Compra de móveis e equipamentos (à vista): R$ 30 000,00",
                "4 – Empréstimo bancário, para ajudar nas operações: R$ 25 000,00",
                "5 – Aquisição de um automóvel: R$ 25 000,00",
                "6 – Aluguel a pagar: R$ 5 00,00",
                "",
                "Faça os lançamentos no Balanço Patrimonial:"
            ]
        },
        {
            "unidade": [
                "PRATICANDO",
                "",
                "Parabéns! Você já compreendeu sobre Balanço Patrimonial, agora, podemos seguir. Vamos aprender outro importante registro contábil, o Balancete de Verificação.2.2.2 Balancete de VerificaçãoSeguimos na nossa jornada, no mundo da Contabilidade, e cada passo é um avanço incrível. Agora vamos compreender sobre um registro essencial, que é o Balancete de Verificação.O Balancete de Verificação é um relatório contábil onde são listadas todas as contas de uma empresa, apresentando todos os saldos devedores e credores de cada conta em um período específico, permitindo verificar se os lançamentos contábeis estão equilibrados, ou seja, a soma dos débitos deve ser igual à soma dos créditos.Obs: o equilíbrio entre crédito e débito surgiu do método das partidas dobradas, que iremos conhecer no tópico 2.3.",
                "A finalidade do Balancete de Verificação é fornecer informação para a Contabilidade verificar se os lançamentos estão corretos, conferindo se o método das partidas dobradas foi seguido, sendo possível visualizar o saldo de todas as contas e realizar ajustes, quando necessário, permitindo ainda entender como está evoluindo o patrimônio da empresa, e fornecer informações para elaborar o Balanço Patrimonial.Preste atenção, todos os dados em Contabilidade se amarram, então, é como se os relatórios contábeis conversem entre si.",
                "#IMAGEM#",
                "",
                "Para preenchimento do Balancete de Verificação, serão necessárias três informações principais:",
                "Conta: pode ser o código ou nome da conta, indica quais contas foram movimentadas, exemplo: caixa, banco, fornecedores etc.",
                "Saldo devedor: que apresenta o valor acumulado do débito da conta.",
                "Saldo credor: que apresenta o valor acumulado do crédito da conta.",
                "",
                "Para ficar mais fácil o entendimento, vamos fazer juntos um lançamento no Balancete de Verificação. Vamos para a prática?",
                "",
                "A loja de informática, TEC TUDO Informática, precisar organizar suas contas, no período de 01/01/24 a 01/02/24 e, para isso, abaixo estão listadas algumas transações financeiras realizadas no mês.",
                "A ideia aqui é fazer o registro de cada uma delas e, ao final, montar o Balancete de Verificação para ver se as contas estão corretas. Preste bastante atenção!",
                "",
                "Transações do Mês",
                "Investimento Inicial: a loja recebeu um investimento inicial de R$ 50 000,00 no caixa da empresa.",
                "Compra de Equipamentos: foram comprados computadores para o escritório no valor de R$ 15 000,00, pagos à vista.",
                "Compra de Mercadorias para Revenda: foram adquiridas mercadorias no valor de R$ 10 000,00, mas o pagamento será feito futuramente (a prazo).",
                "Receita com Venda: a loja vendeu produtos no valor de R$ 5 000,00, recebendo esse valor em dinheiro.",
                "Despesas com Contas: pagamento da conta de energia no valor de R$ 500,00 em dinheiro.",
                "Vejam como esses dados são transferidos para o balancete:",
                "#ATENCAO#",
                "Agora, você precisa prestar muita atenção nisto:",
                "Em uma transação, o valor do débito sempre será igual ao valor do crédito, por isso em cada lançamento tem:",
                "",
                "Conta débito: que é onde o valor será debitado (entrada).",
                "Conta crédito: que é onde o valor será creditado (saída).",
                "#ATENCAO#",
                "",
                "#IMAGEM#",
                "Então vamos lá:",
                "Para facilitar o lançamento no Balancete de Verificação, vamos primeiro identificar as movimentações como débito ou crédito:",
                "#IMAGEM#",
                "Obs.: esse processo que fizemos acima é o método das partidas dobradas, que também vamos ver novamente no tópico 2.3.",
                "#ATENCAO#",
                "Atenção: os débitos e créditos que forem iguais, deverão ser somados.",
                "Exemplo: no débito Caixa temos o valor de R$ 50 000,00 + R$ 5 000,00 = R$ 55 000,00Agora, vamos montar o Balancete de Verificação:",
                "#ATENCAO#",
                "#IMAGEM#",
                "Verifique que ao somar todos os débitos e créditos, encontra-se valores iguais: R$ 80 500,00. Isso mostra que nosso Balancete de Verificação está correto e equilibrado."
            ]
        },
        {
            "unidade": [
                "EXERCITANDO",
                "",
                "Quando se trata de números, só aprendemos fazendo!! Vamos fazer este exercício para aprofundar o conhecimento:Questão 1Faça o Balancete de Verificação da situação abaixo:",
                "O Restaurante Come Come, no período de 01/03/24 a 01/04/24, registrou as seguintes contas:",
                "– Bancos: R$ 5 000 ( saldo devedor)",
                "– Estoque: R$ 3 000 (saldo devedor)",
                "– Empréstimos: R$ 2 000 (saldo credor)",
                "– Capital: R$ 6 000 (saldo credor)",
                "",
                "Obs.: no exercício acima já está apresentado o saldo, então pode ser colocado diretamente no Balancete de Verificação.",
                "#IMAGEM#",
                "O seu Balancete de Verificação ficou:",
                "(  ) Equilibrado",
                "( ) Desequilibrado",
                "2.3 Livro DiárioO Livro Diário é um livro obrigatório (exigido por lei) para todas as empresas jurídicas, sendo que a única exceção é para o Microempreendedor Individual (MEI), que tem um modelo simplificado de recolhimento de tributos e declaração de rendimentos. Logo, precisamos também conhecer esse registro.",
                "Nesse livro, devem ser registrados todos os acontecimentos contábeis efetuados na Contabilidade, dentro do período Ativo da empresa. Estes registros são em ordem cronológica e sequencial de lançamento.Para você conseguir compreender melhor o que é o Livro Diário, imagine a seguinte situação: suponha que você tem um caderno, onde anota tudo o que acontece no seu dia, referente a finanças: todas as entradas e saídas de dinheiro, compras à vista, compras à prazo, e até mesmo os pequenos gastos. Pois bem, você teria um Livro Diário.",
                "Agora, trazendo isso para a realidade de uma empresa, onde ocorre várias movimentações ao longo do dia, é possível perceber que o volume de trabalho é intenso. Antigamente, esses registros eram feitos em livros ou em fichas. Já imaginou o trabalho que isso dava, que monte de papel para arquivar?Mas, atualmente, como já falamos anteriormente, eles podem ser lançados de maneira eletrônica, através do Sistema Eletrônico de Escrituração Digital (SPED), o que se tornou mais prático e menos oneroso para as empresas. Hoje a maioria das empresas optam pelo digital, mas, dependendo do regime, elas podem também optar pelo impresso.Porém, tanto no digital quanto no impresso, os registros devem atender a alguns requisitos básicos de preenchimento, devendo conter:",
                "Data da operação (da movimentação);",
                "Título da conta, se é débito ou crédito;",
                "O Valor do débito e do crédito;",
                "Histórico, com uma breve descrição da transação, explicando o que foi feito, como “Compra de mercadorias” ou “Venda de produtos”.",
                "",
                "Para lançar os dados no Livro Diário, deve–se conhecer as seguintes siglas abaixo:",
                "",
                "#IMAGEM#",
                "+A = mais Ativos (mais bens e direitos)",
                "–A = menos Ativos (menos bens e direitos)",
                "+P = mais Passivos (aumenta dívida/mais obrigações)",
                "–P = menos Passivos (diminui dívida/menos obrigações)",
                "+PL = mais Patrimônio Líquido (mais receita)",
                "–PL = menos Patrimônio Líquido (menos receita)",
                "",
                "Agora, para facilitar, vamos imaginar um exemplo simples na prática:",
                "",
                "1 – Você pagou o aluguel da sua empresa no valor de R$1 000,00. Esse registro vai aparecer no Livro Diário assim:",
                "– Data: 10/11/2024",
                "– Histórico: Pagamento de aluguel",
                "– Débito: despesa com aluguel (R$1 000,00) (–P)",
                "– Crédito: caixa ou Banco (R$1 000,00) (–A)",
                "2 – Você pagou os salários dos funcionários no valor de R$ 5 000,00",
                "– Data: 11/11/2024",
                "– Histórico: Pagamento de salário dos funcionários",
                "– Débito: salários a pagar (R$5 000,00) (–P)",
                "– Crédito: banco (R$5 000,00) (–A)",
                "",
                "#IMAGEM#",
                "#FIQUELIGADO#",
                "O ideal é que esses registros sejam feitos diariamente, mas quando não for possível, que sejam com intervalos curtos, porque, se acumular, pode gerar um grande volume de serviço!",
                "#FIQUELIGADO#",
                "Após tanto aprendizado, é hora de fixar o conteúdo, fazendo os exercícios abaixo:",
                "Questão 1",
                "Marque a opção correta:",
                "(  ) O Livro Diário não é obrigatório, para nenhuma empresa.",
                "(  ) O Livro Diário é exigido apenas para o MEI (Microempreendedor Digital).",
                "( ) O Livro Diário é um livro obrigatório (exigido por lei) para todas as empresas jurídicas, sendo que a única exceção é para o Microempreendedor Individual (MEI).Questão 2",
                "Faça os seguintes lançamentos no Livro Diário:",
                "1º Lançamento",
                "– Data: 01/10/2024",
                "– Histórico: empréstimo realizado no valor de R$ 10 000,00",
                "– Débito: caixa   (R$10 000,00) (+A)",
                "– Crédito: duplicatas a pagar (R$10 000,00) (+P)",
                "",
                "2º Lançamento",
                "– Data: 01/10/2024",
                "– Histórico: pagamento de Impostos no valor de R$ 3 000,00",
                "– Débito: impostos a pagar (R$3 000,00) (–P)",
                "– Crédito: caixa (R$3 00,00) (–A)",
                "",
                "3º Lançamento",
                "– Data: 02/10/2024",
                "– Histórico: pagamento de aluguel no valor R$ 1 000,00",
                "– Débito: despesa com aluguel (R$1 000,00) (–P)",
                "– Crédito: caixa (R$1 000,00) (–A)",
                "",
                "4º Lançamento",
                "– Data: 03/10/2024",
                "– Histórico: compra de mercadorias, a vista, no valor de R$ 7 000,00",
                "– Débito: estoque (R$7 000,00) (+A)",
                "#IMAGEM#",
                "Questão 3",
                "Faça os seguintes lançamentos no Livro Diário:",
                "Para este exercício, considere a situação a seguir:",
                "Imagine que a empresa “Tech Eletrônicos” fez duas transações no dia 12/11/2024:",
                "1. Pagou R$ 500,00 pelo serviço de manutenção do ar–condicionado.",
                "2. Recebeu R$ 2 000,00 pela venda de eletrônicos.Registre os lançamentos no Livro Diário:",
                "#IMAGEM#",
                "Esses exercícios são uma ótima forma de entender como o Livro Diário ajuda a manter as contas da empresa organizadas!",
                "2.4 Livro RazãoO Livro Razão também é um livro obrigatório (exigido por lei) para todas as empresas jurídicas, assim como o Livro Diário, sendo que a única exceção é para o Microempreendedor Individual (MEI), portanto se faz necessário também conhecer esse livro e entender sua aplicação.",
                "O Livro Razão, que também pode ser chamado de Livro Auxiliar, pois trabalha em parceria com o Livro Diário e auxilia na transparência das informações prestadas. Enquanto que no Livro Diário vimos o lançamento das movimentações financeiras com descrição, agora, no Livro Razão, veremos essas movimentações, organizadas por contas.O Livro Razão serve para organizar as informações financeiras por conta e manter um histórico detalhado de todas as movimentações. Ele permite acompanhar as entradas e saídas em cada conta, facilitando o controle e o acompanhamento das finanças da empresa.Além disso, ele é essencial para a elaboração dos Demonstrativos Contábeis, pois, ao final de um período, conseguimos consultar o saldo de cada conta direto no Livro Razão. E o melhor, e que não podemos esquecer, é que ele também pode ser feito por meio eletrônico.",
                "Os registros devem atender a alguns requisitos básicos de preenchimento, devendo conter:",
                "Data da operação (da movimentação);",
                "Título da conta, se é débito ou crédito;",
                "O valor do débito e do crédito;",
                "Histórico, mais sucinto das movimentações. Exemplo: Depósito, Retirada, Duplicata nº 235 etc.",
                "Saldo (para facilitar o acompanhamento da movimentação).",
                "Bora facilitar as coisas? Agora a gente vai ver, na real, como funciona o lançamento no Livro Razão. Se liga aí!\"",
                "",
                "Abaixo está o Livro Razão da Sorveteria Doce Mel, acompanhe alguns lançamentos:",
                "#IMAGEM#",
                "Vale a pena lembrar que: dinheiro que entra, lança na conta débito e dinheiro que sai lança na conta crédito!",
                "2.5 DRE – Demonstração de Resultado e Exercício",
                "Esse nosso processo de aprendizagem uma breve viagem sobre um mundo vasto que depois você poderá escolher como profissão. E aí, aprender muito mais e dominar esta disciplina!Agora vamos conhecer um relatório, que é um dos mais famosos dentro da Contabilidade, é a DRE – Demonstração de Resultado e Exercício. Ele é um relatório contábil que apresenta um resumo ordenado das receitas e despesas da empresa num período determinado, geralmente 12 meses, ou seja, é apontado tudo o que entrou e saiu de dinheiro por meio das operações da empresa (Marion, 2009).Podemos dizer que a principal finalidade da DRE é informar os resultados das operações da empresa. Para ficar mais fácil o entendimento, vamos pensar assim: a DRE permite verificar se a empresa está gerando lucro ou prejuízo, e ainda permite avaliar onde pode realizar melhorias para aumentar a lucratividade. Esse tipo de informação é essencial, pois garante aos gestores e investidores, ou outros interessados, avaliar a saúde financeira da empresa.Esse registro deve ser apresentado na forma vertical, com as etapas bem definidas e deve cumprir alguns requisitos mínimos exigidos, para que de fato possa ser útil e confiável.Vejamos como é uma estrutura básica de uma DRE. Ela pode ser simples para micro ou pequenas empresas, como é o caso de bares, restaurantes, padarias etc., ou pode ser extensa, para empresas de grande porte, onde ocorrem várias movimentações financeiras durante o ano.",
                "#IMAGEM#",
                "#SAIBAMAIS#",
                "Para melhor compreensão do conteúdo, tem um vídeo muito bacana, no canal do Professor Quintino, sobre a DRE. Vamos lá assisti-lo!Vídeo: DRE Demonstração do Resultado do Exercício – Receita Líquida – Lucro Bruto e lucro líquido",
                "https://www.youtube.com/watch?v=mRoClY1mYCk",
                "#SAIBAMAIS#",
                "",
                "Para ficar mais didático, vamos apresentar uma DRE preenchida com números, porque isso irá facilitar o entendimento.",
                "#IMAGEM#",
                "",
                "Observe que no DRE apresentado está todo o movimento financeiro e que, no período de um ano, a empresa fechou o ano com um lucro líquido de R$ 20 000,00.",
                "2.6 Métodos das Partidas Dobradas: débito e CréditoJá estamos finalizando o nosso segundo capítulo, onde aprendemos muito sobre registros de Contabilidade e, para fechar com chave de ouro, vamos conhecer o que é o Método das Partidas Dobradas. Vem comigo!O método das Partidas Dobradas foi desenvolvido pelo Frei Luca Pacioli, no fim do século XV, dando início a uma nova fase para a Contabilidade como disciplina adulta, e esse conceito foi universalmente aceito (Marion, 2009).",
                "#IMAGEM#",
                "O método consiste no fato de que para qualquer operação sempre haverá um débito e um crédito de igual valor, de modo a equilibrar as duas partes. Sendo assim, não há débitos sem créditos correspondentes.",
                "A ideia é bem simples, veja: tudo o que entra na empresa, sai de algum lugar, e tudo que sai precisa ter uma origem/destino, sempre envolvendo os dois lados da conta. Por isso, esse método é essencial para garantir que as finanças da empresa estejam equilibradas.",
                "#IMAGEM#",
                "#FIQUELIGADO#",
                "Agora, se liga! Porque é muito importante entender isso:",
                "Tem uma parte do conceito de conta crédito e conta débito, que precisa ser bem explicado, para não ter dúvidas: Se uma empresa compra mercadorias, ela aumenta o estoque (Ativo) e diminui dinheiro do caixa (que também é um Ativo).",
                "Se a empresa paga uma conta, diminui o valor do caixa (Ativo) e diminui o valor do boleto (Passivo).",
                "#FIQUELIGADO#",
                "Entendeu? Os registros sempre acontecerão em dois momentos, sendo saídas e entradas.Em uma transação financeira, o valor do débito sempre será igual ao valor do crédito, por isso em cada lançamento tem:",
                "Conta débito: que é onde o valor será debitado (entrada).",
                "Conta crédito: que é onde o valor será creditado (saída).",
                "",
                "#IMAGEM#",
                "Agora, vamos aplicar esse conhecimento através de um exemplo prático:",
                "",
                "Vamos imaginar a seguinte situação:",
                "João está registrando uma transação de pagamento de aluguel no valor de R$ 1 500,00, com o dinheiro que ele tem em caixa.",
                "Logo:",
                "– O dinheiro sai do Caixa;",
                "– O dinheiro entra em Aluguel a pagar.",
                "#IMAGEM#",
                "Vamos praticar com mais um exemplo?Maria tem uma loja de artigos de festa, e vendeu em mercadorias o equivalente a R$ 2 000,00, recebendo o valor à vista em dinheiro.Logo:",
                "O dinheiro sai das Mercadorias;",
                "O dinheiro entra em Caixa.",
                "#IMAGEM#"
            ]
        },
        {
            "unidade": [
                "SINTETIZANDO",
                "",
                "A Escrituração Contábil é um processo essencial para o controle financeiro das organizações, permitindo o registro sistemático das operações econômicas e financeiras. Para realizar essa tarefa de forma eficiente, utiliza–se o Plano de Contas, que organiza as informações contábeis em categorias específicas, facilitando a análise e a gestão dos dados. Esse instrumento é fundamental para a padronização e a clareza dos registros contábeis.",
                "Entre os principais Demonstrativos Contábeis estão o Balanço Patrimonial e o Balancete de Verificação. O Balanço Patrimonial fornece uma visão geral da situação financeira da empresa, detalhando os Ativos, Passivos e o Patrimônio Líquido em um determinado período. Já o Balancete de Verificação é uma ferramenta intermediária que auxilia na conferência dos saldos contábeis, garantindo que os débitos e créditos estejam devidamente equilibrados.",
                "O registro detalhado das transações é feito por meio do Livro Diário e do Livro Razão. O Livro Diário documenta cronologicamente todas as movimentações financeiras da empresa, enquanto o Livro Razão organiza esses registros por conta, permitindo uma análise mais específica e aprofundada. Ambos são indispensáveis para a transparência e a auditoria das informações contábeis.",
                "Por fim, a demonstração de resultado do exercício (DRE) apresenta o desempenho econômico da empresa em um período, detalhando receitas, despesas e o resultado, seja lucro ou prejuízo. Esse processo contábil é fundamentado no método das partidas dobradas, que assegura que todo lançamento em uma conta de débito seja compensado por um lançamento equivalente em uma conta de crédito, garantindo a consistência dos registros.",
                "Questão 1",
                "Assinale as questões abaixo como V (VERDADEIRO) ou F (FALSO):",
                "(  )  A principal finalidade da Demonstração de Resultado e Exercício (DRE) é informar os resultados das operações da empresa, permitindo verificar se a empresa está gerando lucro ou prejuízo.",
                "(  ) O método das Partidas Dobradas é um marco na história da Contabilidade, porém infelizmente, não se sabe, quem foi o criador deste método.",
                "(  ) A DRE é um relatório contábil que apresenta um resumo ordenado das receitas e despesas da empresa num período determinado, geralmente as empresas o fazem a cada 24 meses.",
                "(  ) O método das Partidas Dobradas define que para qualquer operação sempre haverá um débito e um crédito de igual valor, de modo a equilibrar as duas partes. Sendo assim, não há débitos sem créditos correspondentes.",
                ""
            ]
        },
        {
            "unidade": [
                "RECAPITULANDO",
                "Em conclusão, a Escrituração Contábil reúne ferramentas e metodologias que formam a base da gestão financeira e da transparência das organizações. O Plano de Contas organiza os registros em categorias bem definidas, funcionando como um guia essencial para o correto acompanhamento das transações. Esses registros são consolidados e analisados por meio dos Demonstrativos Contábeis, como o Balanço Patrimonial, que apresenta a situação financeira da empresa, e o Balancete de Verificação, que assegura a exatidão dos lançamentos contábeis.",
                "Os instrumentos utilizados no registro sistemático dessas operações, como o Livro Diário e o Livro Razão, são indispensáveis para garantir que todas as movimentações estejam devidamente documentadas e organizadas. Enquanto o Livro Diário fornece um registro cronológico, o Livro Razão permite uma visão detalhada por conta, facilitando a gestão e a análise dos dados financeiros.",
                "Além disso, a DRE – Demonstração de Resultado do Exercício cumpre o papel de sintetizar o desempenho econômico da empresa, evidenciando o impacto das receitas e despesas no resultado. Essa estrutura de análise e registro é sustentada pelos métodos das partidas dobradas, que garantem a precisão e o equilíbrio dos lançamentos contábeis, assegurando a confiabilidade das informações.",
                "Portanto, a integração desses elementos é essencial para que a Escrituração Contábil cumpra seu papel de informar, controlar e apoiar a tomada de decisões estratégicas. Com um sistema bem estruturado, as organizações têm em mãos uma poderosa ferramenta para a gestão eficiente e o cumprimento de suas obrigações legais.",
                "#IMAGEM#",
                "#Capítulo#"
            ]
        }
    ]
}]