[{
    "secao": "Capítulo 1 – Fundamentos da Ciência Contábil",
    "subsecao": null,
    "unidades": [
        {
            "unidade": [
                "CONTEXTUALIZANDO",
                "Olá, estudante, vamos juntos iniciar uma jornada incrível no mundo da Contabilidade?",
                "Neste capítulo, iremos compreender a importância dos princípios fundamentais de Contabilidade para garantir a precisão e conformidade dos registros contábeis.",
                "Vamos entender juntos, o que é Contabilidade, para que serve, quem são seus usuários, e a definição de Patrimônio. Essas definições iniciais irão auxiliar na introdução do componente curricular desta disciplina, onde vamos estudar, sobre Contabilidade básica e departamento financeiro.",
                "",
                "Talvez, por envolver números, assim como a disciplina de Matemática, a Contabilidade, por vezes, é bastante temida pelos estudantes, pois ficam com receio de sua complexidade.",
                "Diante disso, podemos dizer que, ao longo dos anos, foi criado um paradigma de que Contabilidade é extremamente difícil, e isso pode diminuir o interesse do   estudante por essa disciplina. No entanto, o ideal é que repensemos sobre isso, pois, assim como a matemática, a Contabilidade está presente em nosso dia a dia, o que demonstra a importância de entendê-la e, por isso vamos juntos quebrar este “tabu” de que Contabilidade é para poucos.  Isso não é verdade, pelo contrário, podemos dizer que sim, a Contabilidade é para todos!",
                "#IMAGEM#",
                "Descrição: comerciante com roupas medievais, em cenário igualmente medieval.",
                "Agora que já introduzimos o nosso assunto, que tal explorarmos onde tudo isso, que hoje chamamos de Contabilidade, começou?",
                "Podemos dizer que há muitos séculos, as relações comerciais já existiam e era necessário ter um controle das vendas, ou melhor, das trocas, pois era uma época, em que a moeda não era distribuída como hoje. Mas, para controlar essas negociações, já era necessário contabilizar, ou seja, organizar as finanças.",
                "Pois é, ter que controlar o dinheiro já é uma questão bem antiga. Estudos apontam que mesmo antes de Cristo (a.C) já existiam registros contábeis, e você acredita que eles eram feitos em blocos de argila? Imagine o trabalho que isso dava! Na figura acima temos um registro contábildo povo da mesopotâmia, aproximadamente 4 000 a.C.",
                "#IMAGEM#",
                "E aí, entendeu alguma coisa que está escrito?",
                "Pois é, eles controlavam a riqueza do palácio real, a produção agrícola, o que era importante de administrar, e então iam anotando tudo nestes blocos de argila.",
                "Mas não dá para ficar na idade da pedra, não é mesmo? Então vamos dar um salto no tempo para, aproximadamente, a época de 1800 d.C, período de Brasil Colônia, quando foi criada a primeira aula de Comércio, no Rio de Janeiro. Essa foi a primeira escola de Contabilidade do Brasil, e de certa forma o ponto de partida para a formação dos profissionais contábeis. Mas o reconhecimento formal da profissão só veio em 1870, com o decreto Imperial nº 4.45, sancionado por Dom Pedro II. Então surgia a profissão dos guarda–livros, que eram os antigos contadores.",
                "#CURIOSIDADE#",
                "Quer conhecer um Decreto de Dom Pedro II? Acesse o link:",
                "DECRETO Nº 4.475, DE 18 DE FEVEREIRO DE 1870",
                "https://www2.camara.leg.br/legin/fed/decret/1824–1899/decreto–4475–18–fevereiro–1870–552838–norma–pe.html",
                "#CURIOSIDADE#",
                "",
                "",
                "",
                "#IMAGEM#",
                "Pense bem, naquela época, não existiam computadores ou sistemas digitais. Tudo era feito à mão! O trabalho dos guarda–livros era tão essencial para a economia que o governo reconheceu a necessidade de regulamentar a profissão, garantindo que apenas pessoas qualificadas pudessem atuar.",
                "Atualmente, a Contabilidade continua sendo uma atividade fundamental para os governos, empresas e até para nós. Assista a este breve vídeo sobre a história da Contabilidade.",
                "#FIQUELIGADO#",
                "Neste link tem a história da Contabilidade de um jeito divertido, assista-o e aprenda mais um pouco!",
                "Vídeo: você conhece a história da Contabilidade?",
                "Link: https://www.youtube.com/watch?v=YSB06–Ax–VI",
                "#FIQUELIGADO#"
            ]
        },
        {
            "unidade": [
                "CONECTANDO",
                "",
                "Já foi possível perceber a importância de estudar a Contabilidade, não foi? Agora, vamos nos conectar a essa realidade e para entendermos melhor a atuação da Contabilidade. Vamos imaginar uma seguinte situação:",
                "#IMAGEM#",
                "João é um jovem antenado, cheio de ideias e sonhos. Ele teve vontade de empreender, então, pensou em montar uma loja física para vender artigos esportivos. Para isso, João  teve a brilhante ideia inicial de abrir uma empresa. Como é bem esperto, procurou uma conhecida que trabalha no Sebrae, a Tina, que o ajudou com algumas perguntas",
                "JOÃO: Oi, Tina, tudo bem? Sei que você trabalha no Sebrae, e poderá me ajudar. Estou pensando em montar uma loja física de artigos esportivos, mas não sei por onde começar. Será que é muito difícil?",
                "TINA: Calma, João, ter um sonho já é um grande avanço, agora é fazê-lo virar realidade. Vamos lá!",
                "JOÃO: Eu vou abrir a minha loja com o quê? O que eu preciso ter em mãos para que eu tenha condições de abrir a minha empresa?",
                "TINA: A resposta é simples: você precisa ter um capital inicial, que significa dinheiro. Você tem alguma quantia?",
                "JOÃO: Sim, eu guardei as minhas mesadas e comecei a trabalhar desde cedo para juntar dinheiro.",
                "TINA: Muito bom! Já que será uma loja física, é necessário um local para se instalar. Você já sabe o local onde quer montar sua loja?",
                "JOÃO: Sim! Já sei! Perto do complexo esportivo Canhoteiro.",
                "TINA: Ótimo! Pronto, já temos capital e o local para abertura da empresa. Agora você vai pensar em equipar a sua loja, com vitrines, balcões, prateleiras, mesas, cadeiras, computador, tapetes, pintura etc.",
                "TINA: Após adquirir todos esses materiais, você deve comprar os itens esportivos para a venda, que serão as mercadorias que serão negociadas.",
                "JOÃO (Com uma cara surpresa, do tipo feliz): Já consigo até ver minha loja pronta, ela será linda, Tina!",
                "TINA: Estou feliz por você João, como é bom ver um jovem buscar os seus sonhos! Mas vamos pensar mais um pouco!",
                "TINA: Imagine a situação. Pronto, sua loja está instalada. Você já gastou o seu dinheiro, ou seja, já aplicou o seu capital inicial, já comprou tudo o que precisava, que pode ter sido à vista ou parcelado. Então, parabéns, você já possui um empreendimento e agora já vai abrir a sua loja! E aí, me responda: qual é o principal objetivo do seu negócio?",
                "JOÃO (Pensativo): Quero ganhar dinheiro! Para poder ajudar minha família, comprar as coisas que desejo, enfim, acho que é isso.",
                "TINA: Isso mesmo, João, você deve querer LUCRO, afinal toda empresa só sobrevive se tiver lucros. E para obter este bom resultado, você precisará comercializar as suas mercadorias.",
                "TINA: Na dinâmica do dia–a–dia de uma loja, você terá contato basicamente com: os fornecedores, que irão vender as mercadorias para você, que irá negociar com eles, valores, prazos e condições de pagamento. Certo?",
                "TINA: E terão os clientes, pensando somente em uma loja física, serão aqueles que vão até sua loja para comprar as suas mercadorias. Essas vendas poderão ser à vista ou a prazo.",
                "JOÃO: Poxa, quanta coisa já aconteceu, né?",
                "TINA: Isso mesmo, João, nesta dinâmica que apresentamos agora, desde o momento em que se tem uma ideia e a coloca em prática, muitos movimentos acontecem, que podem responder às seguintes perguntas:",
                "– Quanto você tinha de capital inicial (dinheiro)?",
                "– Quanto você aplicou em relação a esse capital, foi tudo ou parcial?",
                "– O que e quanto você comprou?",
                "– Quais os bens que agora você possui?",
                "– Se você comprou a prazo, quanto ficou devendo e para quem?",
                "– Se você vendeu a prazo, quanto tem para receber e de quem?",
                "– Se comprou ou vendeu à vista, quanto comprou ou quanto vendeu?",
                "TINA: Enfim, o que e quanto você possui agora?",
                "TINA: Esse movimento de informações, te leva a compreender que você já possui um patrimônio, que gira basicamente em torno de quatro operações, compras, vendas, pagamentos e recebimentos que, quando bem geridas, vão garantir o lucro para a sobrevivência da sua empresa.",
                "JOÃO: Legal, Tina. Consigo, sim, imaginar tudo isso acontecendo!",
                "TINA: Para finalizar a nossa conversa, vou te falar de um setor que irá te ajudar a entender todo este cenário que conversamos, que é a Contabilidade e gestão financeira. Eles vão te fornecer técnicas e ferramentas para garantir um controle eficaz dos movimentos financeiros da sua loja, garantindo um controle do seu patrimônio.",
                "JOÃO: Obrigado, Tina, já vou logo pra casa, e anotar tudo o que conversamos. Depois volto para colocar esta ideia em prática. Valeu!A partir desse diálogo, já foi possível perceber que entender sobre Contabilidade e gestão financeira de uma empresa, podem auxiliar para a realização de um sonho! O sonho de João era de ter uma loja de sucesso! E o seu, qual é?",
                "#FIQUELIGADO#",
                "E você, estudante, já pensou em empreender? Tem algum sonho, assim como o João, de melhorar de vida? Vamos assistir juntos o vídeo abaixo: Você tem algum sonho? Já pensou em ser um empreendedor? Assista o vídeo abaixo e SONHE, afinal, você pode:",
                "Vídeo: o menino no meio da ponte – Sebrae",
                "https://youtu.be/MGgrYMmcRE8",
                "#FIQUELIGADO#"
            ]
        },
        {
            "unidade": [
                "APROFUNDANDO",
                "A Contabilidade é mesmo muito interessante, não é?",
                "Diante do material que estudamos na parte introdutória acima, já foi possível identificar a Ciência Contábil como um pilar necessário para o sucesso de um negócio, pois fornece ao gestor informações importantes que vão auxiliar na tomada de decisão de modo mais assertivo.",
                "De acordo com Ribeiro (1999), podemos conceituar a Contabilidade como:",
                "Contabilidade: é uma ciência que permite, através de suas técnicas, manter um controle permanente do Patrimônio da empresa.",
                "",
                "Nessa definição, devemos ressaltar a necessidade de entender o que é Patrimônio, e o que é empresa. Sendo que, patrimônio, conforme apresentamos no exemplo inicial deste capítulo (da loja de itens esportivos), diz respeito ao dinheiro, vitrines, mesas, computador, mercadorias etc. Enfim, o conjunto de todos os itens necessários para a existência daquele empreendimento.",
                "Obs.: No tópico 1.3, vamos estudar mais detalhado sobre Patrimônio.",
                "Já a empresa, podemos conceituar como uma unidade de produção, resultante da combinação de três fatores da produção (natureza, trabalho e capital) e direcionada para o desenvolvimento econômico.",
                "Para Marion (2009), Contabilidade tem o seguinte conceito:",
                "Contabilidade: é o instrumento que fornece o máximo de informações úteis para a tomada de decisões dentro e fora da empresa.",
                "",
                "A Contabilidade está presente na sociedade desde há muito tempo e sempre auxiliou os gestores nas tomadas de decisões, mas, com o passar do tempo, o governo também passou a se valer deste setor, para arrecadar impostos, e por isso a tornou obrigatória para a maioria das empresas.",
                "Muitas pessoas podem imaginar que o papel principal da Contabilidade é atender às exigências do governo, mas ela não pode ser limitada somente a isso, ela fornece dados precisos e reais, que permitem aos gestores fazer uma avaliação real da situação financeira de suas empresas, podendo realizar ações corretivas ou preventivas, sempre que necessário.",
                "Ações corretivas: são ações que são tomadas após a ocorrência de uma situação indesejada.",
                "Ações preventiva: são ações que são tomadas antes que uma situação indesejada aconteça, de modo a evitála ou minimizar os seus impactos."
            ]
        },
        {
            "unidade": [
                "SINTETIZANDO",
                "",
                "Jovem, no setor de Contabilidade é onde são gerenciados os dados financeiros da empresa, certo? Então, o profissional deste setor, tem a responsabilidade de informar ao gestor, os relatórios sobre os impostos, taxas e contribuições que deverão ser pagos ao governo. Esses impostos vão variar de acordo com o ramo de atuação, eles podem ser federais, estaduais ou municipais.",
                "E, vou te contar uma coisa muito importante! Os impostos, taxas e contribuições são muitos! Para que uma empresa sobreviva, é necessária uma ótima gestão. Acessando o site abaixo, é possível conhecer um pouco sobre os principais tributos cobrados em nosso país:",
                "",
                "Link: https://www.portaltributario.com.br/tributos.htm",
                "",
                "Fala sério, já aprendemos alguns conceitos importantes em Contabilidade, e agora vamos continuar nesta jornada incrível! Mas, antes, a Bia tem uma pergunta:",
                "",
                "#IMAGEM#",
                "",
                "Essa resposta é fácil, pois podemos aplicar em diversas áreas que possam gerar informações financeiras. Vejam só:",
                "",
                "#IMAGEM#",
                "",
                "Vamos aprofundar um pouco nestes ramos de atuação:",
                "EMPRESAS COMERCIAIS",
                "",
                "#IMAGEM#",
                "As empresas comerciais são aquelas que compram e vendem produtos, mas sem fazer grandes mudanças neles. Elas funcionam mais como um “intermediário” entre quem fabrica as coisas e quem vai comprar. O objetivo delas? Ganhar dinheiro vendendo os produtos por um preço mais alto do que o que pagaram.",
                "Essas empresas podem ser de vários tipos: lojas de roupa, supermercados, farmácias, livrarias e distribuidoras. Cada uma tem seu foco, mas a ideia é sempre a mesma: vender o que o público quer.",
                "Agora, a Contabilidade nessas empresas é superimportante! Ela ajuda a controlar o estoque, ver quanto se gastou para vender os produtos, calcular o lucro e garantir que o dinheiro esteja indo para o caminho certo. Por exemplo, numa loja de roupas, a Contabilidade é essencial para registrar as vendas, ver quais roupas estão vendendo mais e planejar a compra de novas peças. Isso ajuda a não ficar com roupa encalhada, né?",
                "",
                "INDÚSTRIAS",
                "#IMAGEM#",
                "Indústria é onde o pessoal pega a matéria–prima e transforma em produtos prontos para vender ou usar em outras produções. O processo envolve transformar coisas como alimentos, tecidos, peças de carro ou até eletrônicos, sempre agregando valor ao material inicial.",
                "Dentro de uma indústria, a Contabilidade de custos é essencial, porque é ela que ajuda a calcular quanto custa para fazer cada produto. Isso inclui tudo: desde a matéria–prima, passando pela mão de obra até as despesas gerais. Por exemplo, numa fábrica de tênis, a Contabilidade vai ajudar a calcular o preço final do produto, considerando o custo de tudo que foi necessário para fabricar cada par de sapato. Assim, a empresa consegue vender com lucro, sem esquecer de nenhum detalhe.",
                "",
                "ORGANIZAÇÕES SEM FINS LUCRATIVOS",
                "",
                "#IMAGEM#",
                "",
                "Organizações sem fins lucrativos são aquelas que existem para ajudar em causas sociais, culturais, educacionais ou humanitárias, mas sem a intenção de dividir lucros entre seus membros ou líderes. Todo o dinheiro que elas recebem é reinvestido nas próprias atividades, com o objetivo de beneficiar a comunidade ou grupos específicos. Exemplos disso são as ONGs, associações, fundações e até igrejas.",
                "Mesmo que o foco dessas organizações não seja ganhar dinheiro, elas também precisam de Contabilidade. Isso porque a Contabilidade ajuda a controlar as doações que entram e as despesas que saem. Assim, elas conseguem prestar contas direitinho e garantir que os recursos estão sendo usados de maneira responsável, sempre com transparência para quem está ajudando.",
                "",
                "SETOR PÚBLICO",
                "#IMAGEM#",
                "",
                "O setor público é formado por tudo o que é controlado pelo governo, como prefeituras, governos estaduais e federais, além de órgãos como autarquias, fundações e empresas estatais. A principal missão dessas entidades é cuidar das necessidades da sociedade, como saúde, educação, segurança e infraestrutura, usando o dinheiro que vem de impostos, taxas e contribuições.",
                "Na Contabilidade do setor público, o objetivo é garantir que o dinheiro público seja bem usado, com transparência e responsabilidade. Ou seja, a Contabilidade ajuda a controlar tudo o que é arrecadado e como é gasto, garantindo que os recursos sejam aplicados de forma eficiente e sem corrupção. E, claro, isso também serve para prestar contas para a população e para os órgãos que fiscalizam a administração pública.",
                "",
                "INSTITUIÇÕES FINANCEIRAS",
                "#IMAGEM#",
                "",
                "Instituições financeiras são aquelas empresas que cuidam de tudo relacionado ao dinheiro: elas ajudam a gerenciar, movimentar e intermediar recursos financeiros. Basicamente, elas captam dinheiro, emprestam, investem ou garantem fundos para pessoas, empresas e até governos. Exemplos disso são bancos, cooperativas de crédito, corretoras, seguradoras e financeiras.",
                "Dentro dessas instituições, a Contabilidade é superimportante. Ela é quem vai registrar e controlar tudo o que acontece: desde a concessão de crédito, o recebimento de depósitos, até os investimentos feitos e o controle dos riscos financeiros. Isso ajuda a garantir que tudo esteja transparente e confiável, além de manter a economia estável e dentro das regras que o setor exige.",
                "",
                "Diante desse amplo cenário de aplicação da Contabilidade, podemos concluir que ela é uma ferramenta indispensável em qualquer organização, pois permite o controle das finanças e auxilia no planejamento estratégico."
            ]
        },
        {
            "unidade": [
                "PRATICANDO",
                "",
                "Já estudamos bastante coisa até aqui! Agora, vamos revisar alguns conceitos através de uma atividade. Vamos lá?",
                "",
                "Questão 01",
                "Abaixo estão apresentadas duas colunas. Na primeira, estão os nomes dos locais de aplicação da Contabilidade e, na segunda coluna, estão os conceitos destes locais. Você deve relacionar a primeira coluna de acordo com a segunda coluna:",
                "",
                "Aplicação",
                "1 – Empresas Comerciais",
                "2 – Indústria",
                "3 – Organização sem fins lucrAtivos",
                "4 – Setor Público",
                "5 – Instituições Financeiras",
                "Conceitos",
                "( ) A principal missão dessas entidades é cuidar das necessidades da sociedade, como saúde, educação, segurança e infraestrutura, usando o dinheiro que vem de impostos, taxas e contribuições.",
                "( ) Todo o dinheiro que elas recebem é reinvestido nas próprias atividades, com o objetivo de beneficiar a comunidade ou grupos específicos.",
                "( ) Elas funcionam mais como um \"intermediário\" entre quem fabrica as coisas e quem vai comprar. O objetivo delas, é ganhar dinheiro vendendo os produtos por um preço mais alto do que o que pagaram.",
                "(  ) Elas captam dinheiro, emprestam, investem ou garantem fundos para pessoas, empresas e até governos.",
                "(  ) O processo envolve transformar coisas como alimentos, tecidos, peças de carro ou até eletrônicos, sempre agregando valor ao material inicial.",
                "",
                "1.1 Princípios fundamentais de Contabilidade",
                "",
                "Agora, vamos aprender que existe um pessoal bem legal e estudada, que cuida e regulamenta o trabalho da Contabilidade aqui no Brasil. Eles, juntos, formam o Conselho Federal de Contabilidade (CFC) que é uma autarquia e o órgão máximo do sistema de registro e fiscalização dos profissionais de Contabilidade no país.",
                "",
                "#CURIOSIDADE#",
                "Significado de autarquia: É uma \"empresa pública\", com autonomia para tomar decisões (econômicas, regras e como vai funcionar), mas ainda é ligada ao governo, que fica de olho e dá uma força quando necessário. Em resumo: é um braço do governo que auxilia nos serviços públicos! Entendeu?",
                "#CURIOSIDADE#",
                "",
                "#IMAGEM#",
                "",
                "O CFC é integrado por um representante de cada estado e mais o Distrito Federal, no total de 27 conselheiros efetivos e igual número de suplentes – Lei nº 11.160/05, e tem, dentre outras finalidades, nos termos da legislação em vigor, principalmente a de orientar, normatizar e fiscalizar o exercício da profissão contábil, por intermédio dos Conselhos Regionais de Contabilidade (CRCs).Pois é, esse pessoal que compõe o CFC é fera em Contabilidade, e para padronizar as práticas contábeis e assegurar a transparência das informações financeiras, eles se reuniram e definiram alguns princípios da Contabilidade.",
                "#IMAGEM#",
                "",
                "Os Princípios da Contabilidade são um conjunto de normas que norteiam a atividade da Contabilidade, de modo a garantir que as demonstrações contábeis seguem um padrão, para que sejam claras, confiáveis e comparáveis. Esses princípios foram consolidados na resolução CFC nº 750/1993 e foi um marco importante para o Brasil.",
                "",
                "#IMAGEM#",
                "",
                "E aí, já estão curiosos para conhecer esses Princípios? Então, vamos lá que vou te apresentar:",
                "",
                "#IMAGEM#",
                "",
                "Vamos entender melhor cada um desses princípios:",
                "",
                "Na resolução CFC nº 750/93, esses princípios estão descritos numa linguagem técnica da Contabilidade, nos exemplos abaixo, vamos colocar de uma maneira um pouco mais direta, para facilitar o entendimento. Mas, prometa que você vai acessar a resolução também para conhecer o documento.Princípio da Entidade – Este quer dizer, basicamente, fica cada um na sua... é que o Patrimônio da empresa (entidade) não pode ser misturado com o dos sócios. A Contabilidade deve ser mantida separada das pessoas físicas dos proprietários e de outras entidades.",
                "Princípio da Continuidade – Este é o princípio do otimismo, que considera que a empresa foi criada para dar certo e continuará operando no futuro, já que toda empresa ao ser aberta, o proprietário deseja que suas atividades sejam por tempo indeterminado, não é isso?",
                "Princípio da Oportunidade – Nada de deixar para depois!! Este princípio determina que os registros e variações sofridas pelo patrimônio devem ser registradas de imediato, independentemente do tipo de pagamento.",
                "Princípio do Registro pelo Valor Original – A parada aqui é registrar o valor dos Ativos e Passivos conforme aquisição e não pelos valores de mercado.",
                "Princípio da Atualização Monetária – Neste princípio, consideramos que os registros contábeis devem ser atualizados de acordo com as variações de poder aquisitivo da moeda nacional.",
                "Princípio da Competência – Estabelece que as receitas e despesas devem ser registradas no período em que ocorrem, independente do pagamento ou recebimento. Por exemplo, esse princípio significa que a empresa sinaliza que tem que pagar um fornecedor, mesmo que ainda não tenha chegado a data, ou sinaliza que tenha que receber algum pagamento, mesmo que ainda também não tenha chegado a data. Entendeu? Isso auxilia os gestores a terem uma visão real da situação financeira da empresa.",
                "Princípio da Prudência – Já ouviu o ditado popular “Seguro morreu de velho”? Pois é, este princípio orienta a adoção de alternativa que minimize resultados e riscos no caso de incerteza. Por exemplo, quando for atualizar os registros contábeis, deve–se considerar adotar o menor valor para os componentes do Ativo e do maior para os do Passivo. Essa ação conservadora garante que não estão superestimando o valor do Patrimônio da empresa.",
                "#FIQUELIGADO#",
                "Aqui está o link conforme anunciado acima e, para ler a resolução completa, basta acessá-lo:",
                "RESOLUÇÃO CFC Nº 750 DE 29 DE DEZEMBRO DE 1993",
                "https://www.portaldeContabilidade.com.br/nbc/res750.htm",
                "#FIQUELIGADO#",
                "",
                "Pois bem, terminamos de estudar os Princípios da Contabilidade, onde foi possível perceber a importância deles, pois são a base para qualquer análise ou registro contábil e, mais do que isso, garantem uma transparência e confiabilidade nas informações contábeis.",
                "#FIQUELIGADO#",
                "Se liga nesta notícia: desde o ano de 2017 a regulamentação dos Princípios da Contabilidade passou por uma revogação, que quer dizer, uma melhoria, visando uma melhor compreensão dos conceitos.",
                "#FIQUELIGADO#",
                "“Revogar a Resolução nº 750/1993, porém, não significa que os Princípios de Contabilidade estejam extintos. A revogação das resoluções visa à unicidade conceitual, indispensável para evitar divergências na concepção doutrinária e teórica, que poderiam comprometer aspectos formais das Normas Brasileiras de Contabilidade (NBCs).”",
                "Então, o pessoal da Contabilidade se reuniu e fizeram melhorias em relação à aplicação dos princípios estudados. Abaixo está o link que menciona esta revogação.",
                "Acesse-o e fique bem-informado!",
                "O texto acima está no artigo no link abaixo:",
                "https://cfc.org.br/noticias/revogacao–da–resolucao–no–7501993–contexto–e–consideracoes/",
                "",
                "E aí, conseguiu entender os Princípios da Contabilidade?",
                "Para reforçar, faça os exercícios abaixo:",
                "",
                "Questão 02",
                "Encontre no caça palavra abaixo os Princípios da Contabilidade:",
                "ENTIDADE",
                "CONTINUIDADE",
                "OPORTUNIDADE",
                "REGISTRO PELO VALOR ORIGINAL",
                "ATUALIZACAO MONETÁRIA",
                "COMPETÊNCIA",
                "PRUDÊNCIA",
                "",
                "Questão 3",
                "Vamos discutir, em sala, sobre Princípios da Contabilidade.",
                "",
                "1.2 Usuários",
                "",
                "Vocês já devem ter percebido a importância da Contabilidade para as empresas, visto que ela auxilia nas análises do andamento dos resultados, contribuindo para a sobrevivência dos negócios, mas também devemos nos perguntar, afinal, quem são os usuários desta ciência?",
                "Bom, os usuários da Contabilidade são aquelas pessoas que utilizam os dados fornecidos pela Contabilidade para alguma tomada de decisão. Onde cada usuário tem seus interesses próprios.",
                "",
                "Vamos aos exemplos de tipos de usuários, para maiores esclarecimentos:",
                "",
                "#IMAGEM#",
                "",
                "",
                "Uau, quanta gente! E estão todas interessadas no trabalho da Contabilidade, pois tem muita gente de olho... Então, por isso, o trabalho deve ser executado com precisão e seriedade. Geralmente esses usuários acima, podem ser classificados como Internos e Externos:",
                "",
                "#IMAGEM#",
                "Os usuários internos, são aqueles que estão diretamente ligados aos resultados da empresa, fazem parte dos processos de decisão e influenciam nos planejamentos da empresa. Como, por exemplo, o gerente e o diretor podem decidir sobre a viabilidade de abrir uma filial de um supermercado, para isso, vão analisar os dados contábeis e tomar a decisão mais assertiva.",
                "Já os usuários externos são aqueles que têm interesse no resultado da empresa, mas não estão diretamente dentro da empresa, por isso, às vezes, os relatórios que eles têm acesso são menos densos de informação do que os de quem está dentro da empresa. Para ficar mais fácil de entender, vamos pensar no banco. O gerente do banco não trabalha dentro da empresa, mas ele tem interesse em saber os resultados da empresa, para verificar se concede uma linha de crédito ou não, enquanto o governo tem interesse pelas informações contábeis para verificar se os impostos estão sendo pagos devidamente, ou se pode estar havendo alguma sonegação.",
                "#IMAGEM#",
                "",
                "Dentro dos registros contábeis podem ser gerados vários tipos de relatórios, que veremos nos capítulos posteriores, e é de suma importância saber destinar o relatório certo para a pessoa certa, a fim de que os interessados tomem decisões baseadas em dados sólidos e reais.",
                "",
                "#SAIBAMAIS#",
                "Tem um vídeo muito bom, que o Professor Quintino colocou em seu canal, explicando sobre os usuários da Contabilidade e, de relance, ele falou o nome de alguns importantes relatórios. Bora lá, assistir a este vídeo?Nome do vídeo: Usuários da Contabilidade. Usuários internos. Usuários externos. Estrutura conceitual.",
                "Professor Quintino",
                "https://youtu.be/0–rR6WXYXQ4",
                "#SAIBAMAIS#",
                "1.3 Patrimônio",
                "",
                "Neste tópico, vamos falar de Patrimônio: Passivo, Ativo e Líquido, palavras que norteiam o dia-a-dia da Contabilidade e, por isso, é importante saber bem o significado e empregabilidade delas.",
                "Agora sim vamos avançar na parte prática de lançamentos no mundo da Contabilidade. Vamos lá continuar esta viagem fantástica?",
                "",
                "#IMAGEM#",
                "",
                "Pois bem, vamos interagir? Me diga o que você acha que significa PATRIMÔNIO?",
                "Inicialmente, pensamos que patrimônio é tudo aquilo que uma pessoa ou uma empresa possuem, ou seja, suas posses. Porém, nos termos da Contabilidade, vamos além, e passamos a considerar como patrimônio os bens pertencentes, os direitos (valores a receber) e as obrigações (valores a serem pagos).",
                "",
                "#IMAGEM#",
                "",
                "Para facilitar a análise do patrimônio é utilizada uma representação gráfica, que permite dividir os termos acima. Preste bastante atenção, pois os lados não podem ser confundidos:",
                "Inicialmente, construímos um “T”. Isso mesmo, um T.",
                "#IMAGEM#",
                "Mas... o que fazemos com esse T?",
                "Bem, vamos dividi-lo: de um lado os bens e direitos e do outro lado as obrigações.",
                "#IMAGEM#",
                "Por enquanto, é só isso! Daqui a pouco tem mais.",
                "Basicamente, os bens são “propriedades”, enquanto os direitos referem-se àquele valor que a empresa ou pessoa tem a receber, e obrigações, àquilo que deve ser pago. Mas, não será simples assim. Para um melhor entendimento, será necessário aprofundar nesses termos, vamos lá?1.3.1 Passivo",
                "O que será que significa esse tal de Passivo?",
                "Calma lá, vou te explicar agora. Afinal, esse termo é extremamente usado em Contabilidade, portanto, é necessário a total compreensão. Lembra que vimos que em Patrimônio também estão as Obrigações? Pois é, estas são o Passivo de uma empresa ou pessoa, ou seja, é tudo aquilo que precisa ser pago.",
                "",
                "OBRIGAÇÕES = PASSIVO",
                "",
                "Por exemplo, é comum as empresas realizarem compras a prazo, e quando isso ocorre, é gerado um boleto que deverá ser quitado posteriormente, por que a compra foi a prazo, correto? Assim, a empresa fica com a OBRIGAÇÃO de pagar o valor desta compra num determinado prazo.",
                "Também podemos citar o salário de um funcionário, que deverá ser pago no início do mês, portanto confere uma OBRIGAÇÃO a ser cumprida. Pense bem, toda despesa vai gerar um pagamento, logo, gera também uma OBRIGAÇÃO. Geralmente os Passivos serão acompanhados das expressões: a pagar, a recolher, a liquidar etc.",
                "Lembra o T que fizemos acima? Agora, já podemos inserir a palavra Passivo nele, veja como vai ficar:",
                "#IMAGEM#",
                "1.3.2 AtivoAgora, a palavra da vez é Ativo!",
                "Pois bem, lembra que dentro de patrimônio temos os bens e direitos? Pois é, eles formam os Ativos de uma empresa ou pessoa. Ou seja, os Ativos são algo bom, porque aumenta as posses. Para um melhor entendimento, vamos explicar sobre bens e direitos.",
                "",
                "BENS E DIREITOS = ATIVOS",
                "",
                "Bens são as coisas úteis, capazes de satisfazer as necessidades das pessoas ou empresas. Eles podem ser palpáveis, então denominamos de bens tangíveis, ou podem ser não palpáveis, então bens intangíveis.",
                "Imaginem, estamos dentro de um supermercado, e lá existem prateleiras, mercadorias, freezers, caixas eletrônicos, computadores, carrinhos de compras, e muito mais que podemos ver. Esses bens são tangíveis, e podem ser facilmente mensurados o seu valor econômico.",
                "Embora os bens intangíveis também possuem valor, eles não são matérias. Vamos dar um exemplo: pense na Coca–Cola, o valor dessa marca é altíssimo, mesmo sendo algo que não visualizamos.",
                "Os bens, além de tangíveis ou intangíveis, também podem ser classificados como móveis ou imóveis:",
                "Bens móveis: são aqueles que podem ser removidos do seu lugar sem danos de seu estado. Exemplos: mesas, cadeiras, equipamentos, mercadorias, veículos etc.",
                "",
                "Bens imóveis: são aqueles que estão fixos ao solo ou subsolo, e que não podem ser removidos sem destruição ou danos. Exemplos: edifício, terreno, casa, árvores etc.",
                "",
                "Já falamos sobre os bens, ficou entendido? Agora vamos tratar sobre a definição de direitos:",
                "Direitos: são todos os valores a receber de terceiros, os quais a empresa tem o poder de exigir o recebimento.",
                "",
                "Sabe aquelas lojas que ainda fazem “notinha” quando vendem algo, aí o cliente vem e paga depois? Pois é, se alguém comprou ali, a loja passa a ter o direito de receber, e caso não receba, também tem o direito de cobrar. Geralmente, os direitos são coisas a receber, a compensar, a recuperar etc. Entendeu? Viu que é algo bom?",
                "Agora, vamos representá-los no gráfico.",
                "#IMAGEM#",
                "Demos um passo muito importante no nosso aprendizado de Contabilidade, agora memoriza aí esse esquema, porque vamos avançar mais!",
                "Mas, antes, que tal praticarmos um lançamento?",
                "",
                "EXEMPLIFICANDO:",
                "",
                "A loja da Virgínia é uma loja de roupas bonitas e elegante, e fica instalada no centro do Maranhão. Ela possui os seguintes elementos do patrimônio:",
                "#IMAGEM#",
                "Ela quer organizar o Patrimônio dele dentro do T, pois a primeira coisa a fazer é organizar, o que são bens e direitos (ATIVOS) e obrigações (PASSIVO).",
                "Agora ficou fácil, é só representar no balanço:",
                "#IMAGEM#",
                "Lançamentos feitos! Você observou que o Ativo foi lançado no lado esquerdo e o Passivo no lado direito?",
                "Pois é, isso vai ser sempre assim, tá? Porque isso foi definido em reunião entre o pessoal da Contabilidade. Agora, vamos aprender mais sobre Contabilidade!",
                "1.3.3 Patrimônio Líquido",
                "Veja só, aprendemos uma parte básica da montagem do patrimônio, e agora vamos para um conceito superimportante, que engloba tudo o que vimos até aqui! É o Patrimônio Líquido.",
                "Patrimônio Líquido: é a diferença entre os valores positivos (bens e direitos) menos os valores negAtivos (obrigações).",
                "",
                "Os bens e direitos, que constituem os Ativos, são considerados elementos positivos (+), enquanto as obrigações, que são os Passivos, são os elementos negAtivos (–). Essa analogia nos permite entender o que significa o Patrimônio Líquido.",
                "",
                "#IMAGEM#",
                "Vamos transformar isso numa equação:",
                "Patrimônio Líquido = Bens + Direitos – Obrigações",
                "O Patrimônio Líquido permite saber a real condição financeira da empresa. Vamos  pensar um pouco!",
                "Imagine que você passa em frente a uma empresa, com fachada muito bonita, letreiros iluminados, funcionários bem-vestidos, carros novos, tudo impecável... Logo pensamos: como essa empresa tem muito dinheiro! Não é isso?",
                "",
                "#IMAGEM#",
                "Mas, atenção! Ficamos sabendo que essa empresa deve muito, e está com pagamentos de fornecedores atrasados, os carros são financiados e não estão pagando. Inclusive, estão com dificuldade até para comprar matéria prima, porque seu nome está sujo no mercado.",
                "Agora, depois de tudo que vimos até aqui, como você acha que está a situação financeira desta “bonita” empresa?Com esse simples exemplo, aprendemos que uma riqueza não é medida somente pelo o que se tem, mas, também, deve–se considerar o que se deve! Por isso o Patrimônio Líquido nos permite conhecer a real situação financeira.Agora, vamos inserir o Patrimônio Líquido na nossa representação gráfica, veja como vai ficar:",
                "#IMAGEM#",
                "",
                "Já deu para perceber o quão importante é saber realmente qual é o Patrimônio Líquido de uma empresa, não é mesmo? Ele que vai dizer se as coisas estão boas ou não.Pois bem, esse Patrimônio Líquido pode apresentar três variações:",
                "Situação Líquida Positiva;",
                "Situação Líquida Negativa;",
                "Situação Líquida Nula.",
                "",
                "Para ficar mais didático, vamos aprender isso na prática:",
                "SITUAÇÃO LÍQUIDA POSITIVA",
                "Na situação líquida positiva, o Ativo é maior que o Passivo. Vamos usar um exemplo simples para entender:",
                "",
                "Exemplo:",
                "A Empresa Tem de Tudo possui os seguintes elementos de Patrimônio:",
                "Bens = R$500,00",
                "Direitos = R$300,00",
                "Obrigações: R$ 350,00",
                "",
                "Lembrando que:",
                "PL = Bens + Direitos – Obrigações",
                "PL = 500,00 + 300,00 – 350,00",
                "PL = R$ 450,00",
                "",
                "Trazendo para a representação gráfica:",
                "#IMAGEM#",
                "Neste caso, podemos dizer que a situação financeira está ótima, pois tem–se mais dinheiro do que se deve.",
                "",
                "SITUAÇÃO LÍQUIDA NEGATIVA",
                "",
                "Mas, como nem tudo são flores, também podemos ter um cenário ruim, que é a Situação Líquida Negativa, neste caso o meu Passivo é maior do que o Ativo. Vejam só:",
                "Exemplo:",
                "Bens = R$500,00",
                "Direitos = R$300,00",
                "Obrigações: R$900,00",
                "",
                "Lembrando que:",
                "PL = Bens + Direitos – Obrigações",
                "PL = 500,00 + 300,00 – 900,00",
                "PL = (–) R$100,00",
                "",
                "Trazendo para a representação gráfica:",
                "#IMAGEM#",
                "Neste caso, podemos dizer que a situação financeira está péssima, pois deve–se mais dinheiro do que se tem. Aí deu ruim, né?",
                "",
                "SITUAÇÃO LÍQUIDA NULA",
                "",
                "E a próxima situação, é Situação Líquida Nula, que é quando o Ativo e Passivo são iguais.",
                "",
                "Exemplo:",
                "Bens = 500,00",
                "Direitos = 300,00",
                "Obrigações: 800,00",
                "",
                "Lembrando que:",
                "PL = Bens + Direitos – Obrigações",
                "PL = 500,00 + 300,00 – 800,00",
                "PL = 0,00",
                "",
                "Trazendo para a representação gráfica:",
                "#IMAGEM#",
                "Neste caso, podemos dizer que a situação financeira está nula, porque Ativo e Passivo são iguais. Isso também não está bom, porque não tem dinheiro sobrando!",
                "Os Princípios Fundamentais de Contabilidade formam a base para o registro e análise das informações financeiras, garantindo uniformidade, clareza e confiabilidade nos dados apresentados. Esses princípios, como o da entidade, continuidade e competência, entre outros, orientam a prática contábil, assegurando que os registros reflitam a realidade econômica e financeira das organizações de maneira transparente e padronizada.",
                "Os usuários das informações contábeis abrangem um amplo grupo de interessados, como gestores, investidores, credores, órgãos reguladores e o público em geral. Cada um desses grupos utiliza os dados contábeis para finalidades específicas, como avaliar a saúde financeira da entidade, tomar decisões de investimento ou monitorar o cumprimento de obrigações fiscais e legais. A Contabilidade, assim, desempenha um papel crucial ao fornecer informações relevantes para a tomada de decisões.",
                "O patrimônio é o conjunto de bens, direitos e obrigações de uma entidade, sendo a base para a análise de sua situação financeira e econômica. Ele é dividido em três componentes principais: Ativo, Passivo e Patrimônio Líquido. O Ativo compreende os bens e direitos da entidade que representam recursos controlados capazes de gerar benefícios futuros, como dinheiro em caixa, estoques e equipamentos.",
                "Por outro lado, o Passivo corresponde às obrigações da entidade perante terceiros, como dívidas e compromissos financeiros, refletindo o que deve ser pago ou cumprido. Já o Patrimônio Líquido é a diferença entre o Ativo e o Passivo, representando os recursos próprios da entidade que pertencem aos seus proprietários ou acionistas. Essa estrutura permite que os usuários compreendam a composição e o equilíbrio financeiro da organização, facilitando o planejamento e a gestão de recursos."
            ]
        },
        {
            "unidade": [
                "EXERCITANDO",
                "Agora, é hora de colocar a mão na massa e rever tudo o que aprendemos até aqui.",
                "",
                "Questão 4Vamos colocar números nos elementos da Loja da Virgínia, o que nos permitirá saber como está o Patrimônio Líquido de sua empresa. Vamos juntos!",
                "Calcule o Patrimônio Líquido:",
                "PL = Bens + Direitos (ATIVO) – Obrigações (PASSIVO)",
                "PL =",
                "PL =",
                "Agora faça a análise e marque a opção correta:",
                "(  ) Situação Líquida Positiva",
                "(  ) Situação Líquida Negativa",
                "(  ) Situação Líquida Nula",
                "Quanta coisa já aprendemos ainda neste primeiro capítulo! Já avançamos um grande passo no mundo da Contabilidade. Preparados para conhecer mais?",
                ""
            ]
        },
        {
            "unidade": [
                "RECAPITULANDO",
                "Os Princípios Fundamentais de Contabilidade fornecem a base teórica e prática para que as organizações registrem e analisem suas operações financeiras de forma padronizada e confiável. Esses princípios asseguram que as informações contábeis atendam às necessidades dos usuários, sejam eles gestores, investidores, credores ou reguladores, permitindo decisões mais informadas e estratégicas.",
                "A compreensão do patrimônio como um todo – englobando o Ativo, o Passivo e o Patrimônio Líquido – é essencial para avaliar a saúde financeira e econômica de qualquer entidade. Enquanto o Ativo representa os recursos e direitos que geram benefícios futuros, o Passivo reflete as obrigações e compromissos que devem ser honrados, e o Patrimônio Líquido revela a parcela dos recursos que pertencem efetivamente aos proprietários.",
                "Portanto, a integração desses conceitos é crucial para que a Contabilidade cumpra seu papel de ser uma ferramenta indispensável na gestão organizacional. Assim, ao dominar os fundamentos aqui apresentados, é possível estabelecer uma base sólida para avançar no estudo e na prática da ciência contábil, contribuindo para a sustentabilidade e o sucesso das organizações.",
                "#IMAGEM#",
                "#Capítulo#"
            ]
        }
    ]
}]