[{
    "secao": "Capítulo 2 – Levantamento de requisitos",
    "subsecao": null,
    "unidades": [
        {
            "unidade": [
                "CONTEXTUALIZANDO",
                "O levantamento de requisitos é o primeiro passo para construir um sistema que atenda de forma completa às necessidades dos usuários e stakeholders. Neste capítulo, exploraremos como identificar e registrar os requisitos funcionais e não funcionais, garantindo uma base sólida para o desenvolvimento de software.",
                "O levantamento de requisitos é o alicerce de qualquer projeto de software bem-sucedido. Essa etapa inicial define o que o sistema deve fazer (requisitos funcionais) e como ele deve se comportar para garantir uma boa experiência (requisitos não funcionais), como desempenho, segurança e usabilidade. Sem um levantamento adequado, o desenvolvimento pode sair dos trilhos, resultando em um sistema que não atende às expectativas dos envolvidos.",
                "Aqui, você descobrirá técnicas eficazes para entrevistar clientes, identificar e priorizar funcionalidades e documentar todos os aspectos críticos do sistema de forma clara e objetiva. Esse processo é fundamental para alinhar as expectativas e garantir que a visão de todos seja compreendida e transformada em um sistema que realmente agregue valor.",
                "",
                "Definição",
                "O levantamento de requisitos é a primeira etapa do ciclo de desenvolvimento de software, em que são coletadas, organizadas e documentadas as necessidades e as expectativas dos stakeholders – que incluem clientes, usuários finais e gestores do projeto. O principal objetivo dessa fase é garantir que o sistema a ser desenvolvido atenda plenamente às necessidades dos usuários e aos requisitos de negócio, criando uma base sólida para o desenvolvimento.",
                "#CURIOSIDADE#",
                "Você sabia? A prática de levantamento de requisitos vem de disciplinas como a engenharia civil e a arquitetura, nas quais entender as necessidades dos “usuários” (os futuros habitantes ou visitantes de um prédio) é essencial para garantir que a estrutura atenda aos requisitos específicos de uso e segurança. Assim como essas áreas, o desenvolvimento de software utiliza requisitos para planejar e construir sistemas que realmente atendam às expectativas dos usuários.",
                "#CURIOSIDADE#",
                "",
                "Durante essa etapa, identificamos dois tipos principais de requisitos:",
                "Requisitos funcionais definem o que o sistema deve fazer, enquanto requisitos não funcionais detalham como ele deve funcionar em termos de desempenho, segurança, usabilidade e confiabilidade.",
                "Exemplos:",
                "Requisito funcional: Em um sistema de e-commerce, permitir que o usuário faça uma compra online.",
                "Requisito não funcional: Assegurar que o tempo de resposta para adicionar um item ao carrinho seja de até dois segundos.",
                "",
                "O que são requisitos funcionais e não funcionais?",
                "Requisitos funcionais:",
                "São as funcionalidades que o sistema deve oferecer para atender às necessidades dos usuários.",
                "Exemplo: “O sistema deve permitir que os usuários façam login utilizando seu e-mail e senha”.",
                "",
                "Requisitos não funcionais:",
                "Descrevem características de qualidade que o sistema deve ter, como desempenho, segurança, confiabilidade e facilidade de uso.",
                "Exemplo: “O sistema deve carregar as páginas em até três segundos”.",
                "",
                "#ATENCAO#",
                "A diferença entre requisitos funcionais e não funcionais é essencial para o sucesso do levantamento. Enquanto os requisitos funcionais descrevem o que o sistema deve fazer, os não funcionais indicam como o sistema deve se comportar em termos de segurança, desempenho, usabilidade etc. É importante capturar ambos para garantir que o sistema atenda às expectativas em todos os aspectos.",
                "#ATENCAO#"
            ]
        },
        {
            "unidade": [
                "CONECTANDO",
                "O levantamento de requisitos conecta as necessidades dos stakeholders ao desenvolvimento de software, assegurando que todas as funcionalidades e os comportamentos esperados sejam definidos de maneira clara antes da implementação. Essa etapa é crucial para evitar erros e mal-entendidos nas fases posteriores do projeto, o que reduz o risco de retrabalho e aumenta a satisfação do cliente com o produto final.",
                "Existem várias técnicas de levantamento de requisitos que ajudam a identificar as necessidades dos usuários e stakeholders:",
                "Entrevistas: Ideais para obter informações detalhadas de stakeholders específicos.",
                "Questionários: Úteis quando precisamos de feedback amplo e quantitativo.",
                "Workshops: Reuniões colaborativas em que todos discutem coletivamente os requisitos, promovendo alinhamento.",
                "Essas técnicas permitem que a equipe de desenvolvimento compreenda melhor o contexto do projeto e as expectativas de quem usará o sistema, proporcionando uma base sólida para a construção de um software alinhado aos objetivos de negócio e às necessidades dos usuários."
            ]
        },
        {
            "unidade": [
                "APROFUNDANDO",
                "Tipos de requisitos:",
                "Requisitos funcionais:",
                "Esses requisitos definem as funcionalidades principais que o sistema deve oferecer para atender aos objetivos dos usuários e do negócio. Eles se concentram nas operações e nos processos essenciais que o sistema deve executar.",
                "Exemplo: Em uma plataforma de e-commerce, o sistema deve permitir que o usuário adicione produtos ao carrinho, visualize o valor total e finalize a compra.",
                "Requisitos não funcionais:",
                "Esses requisitos abordam os atributos de qualidade e as restrições sob as quais o sistema deve operar, cobrindo aspectos como desempenho, segurança e usabilidade. Eles garantem que o sistema funcione de forma eficaz e ofereça uma experiência confiável.",
                "Exemplo: Em um sistema de gestão financeira, o sistema deve carregar as páginas em até dois segundos e manter uma disponibilidade de 99,9%, assegurando o acesso constante dos usuários.",
                "",
                "Figura: Comparação entre requisitos funcionais e não funcionais, com exemplos práticos.",
                "",
                "#IMAGEM#",
                "",
                "Processo de levantamento de requisitos:",
                "O levantamento de requisitos é um processo estruturado e essencial para garantir que o sistema seja projetado com base nas necessidades reais dos stakeholders. Esse processo envolve várias etapas fundamentais:",
                "Identificação dos stakeholders: A primeira etapa é identificar todas as partes interessadas no projeto, incluindo clientes, usuários finais e gerentes de projeto. Essa identificação é crucial para entender diferentes perspectivas, expectativas e necessidades.",
                "Coleta de informações: Com os stakeholders definidos, a próxima fase é a coleta de informações sobre o sistema desejado. Técnicas como entrevistas, questionários, análise de documentos e workshops são utilizadas para capturar os requisitos de forma abrangente. Cada técnica permite explorar as necessidades de diferentes formas, oferecendo uma visão completa sobre o sistema.",
                "Análise de requisitos: Após coletar as informações, é preciso analisar os requisitos para identificar e resolver conflitos, priorizar funcionalidades e esclarecer qualquer ambiguidade. Essa etapa é essencial para garantir que todos compreendam os requisitos da mesma forma, evitando interpretações erradas que poderiam impactar o desenvolvimento.",
                "Documentação de requisitos: Finalmente, os requisitos são especificados de maneira clara e detalhada, criando um documento de referência. Essa documentação precisa ser validada e acordada por todos os stakeholders, assegurando que todos estejam alinhados quanto às funcionalidades e ao comportamento esperado do sistema antes do início do desenvolvimento.",
                "",
                "#IMAGEM#",
                "",
                "#FIQUELIGADO#",
                "Documentar os requisitos de forma clara é essencial para evitar mal-entendidos entre desenvolvedores e stakeholders. Quando bem documentados, os requisitos servem como uma referência durante todo o ciclo de vida do projeto e ajudam a alinhar a equipe com os objetivos do sistema. A documentação é, portanto, mais do que um simples registro – ela é uma ferramenta de comunicação.",
                "#FIQUELIGADO#",
                "Técnicas de levantamento de requisitos:",
                "Para entender as necessidades dos stakeholders e captar os requisitos com precisão, várias técnicas podem ser aplicadas. Cada uma oferece uma abordagem diferente, que pode ser combinada conforme necessário para alcançar uma visão completa do sistema.",
                "#FIQUELIGADO#",
                "",
                "#CURIOSIDADE#",
                "As técnicas de levantamento de requisitos evoluíram muito com o tempo. Nos primeiros projetos de software, era comum que o levantamento de requisitos fosse feito informalmente através de reuniões e anotações manuais. Hoje, com a complexidade dos sistemas, técnicas como entrevistas estruturadas, questionários e workshops são usadas para garantir que todos os detalhes importantes sejam capturados e organizados de forma eficaz.",
                "#CURIOSIDADE#",
                "",
                "Entrevistas: Consistem em conversas diretas com stakeholders-chave para coletar informações detalhadas sobre suas expectativas e necessidades específicas. As entrevistas permitem uma compreensão profunda, possibilitando que o entrevistador faça perguntas exploratórias e obtenha insights sobre requisitos que podem não ter sido considerados inicialmente.",
                "Questionários: São formulários estruturados, enviados para um grande número de stakeholders, visando coletar respostas padronizadas. Essa técnica é útil quando há uma grande quantidade de participantes, pois permite identificar padrões e tendências nas respostas, fornecendo uma visão geral das necessidades e das preferências dos usuários de forma eficiente.",
                "Workshops: Sessões colaborativas que reúnem stakeholders e a equipe de desenvolvimento para brainstorming e discussões estruturadas. Os workshops facilitam o alinhamento entre diferentes partes interessadas e permitem que todos contribuam para a definição das funcionalidades principais do sistema, promovendo uma compreensão compartilhada e consensual sobre o projeto.",
                "",
                "#SAIBAMAIS#",
                "Deseja explorar métodos avançados de levantamento de requisitos? Algumas abordagens, como “análise de tarefas” e “etnografia de software”, são utilizadas em projetos complexos para entender profundamente as necessidades dos usuários. Você pode encontrar mais sobre essas técnicas em IIBA - International Institute of Business Analysis.",
                "#SAIBAMAIS#",
                "",
                "Exemplo de documentação",
                "Cenário: Sistema de reservas de consultas médicas",
                "1. Documentação de requisitos funcionais",
                "#IMAGEM#",
                "Requisitos não funcionais",
                "#IMAGEM#",
                "2. Modelo de gestão de requisitos matriz de priorização MoSCoW",
                "#IMAGEM#",
                "3. Rastreabilidade de Requisitos e Casos de Uso",
                "#IMAGEM#",
                "4. Exemplo de documento de requisitos título: sistema de reservas de consultas médicas\nObjetivo: Facilitar o agendamento de consultas médicas de forma online, permitindo que pacientes e médicos organizem seus compromissos.\nEscopo:",
                "Inclui: Cadastro de pacientes, agendamento e cancelamento de consultas.",
                "Exclui: Integração com sistemas de pagamento e gerenciamento financeiro."
            ]
        },
        {
            "unidade": [
                "PRATICANDO",
                "Atividade prática: Coleta de requisitos para um sistema de biblioteca",
                "Objetivo: Praticar o levantamento de requisitos aplicando uma técnica à sua escolha.",
                "Instruções: Escolha uma técnica de levantamento (entrevista, questionário ou workshop) e identifique cinco funcionalidades essenciais para um sistema de biblioteca, como:",
                "Empréstimo de livros",
                "Reservas de livros",
                "Geração de relatórios de uso",
                "Atenção",
                "Ao documentar, separe claramente os requisitos funcionais dos não funcionais. Isso facilita o entendimento e ajuda a equipe a priorizar as funcionalidades mais importantes para o sistema."
            ]
        },
        {
            "unidade": [
                "SINTETIZANDO",
                "O levantamento de requisitos é uma fase essencial no desenvolvimento de software, pois define com precisão o que o sistema deve fazer (requisitos funcionais) e as qualidades que ele deve ter (requisitos não funcionais). Essa diferenciação é fundamental para garantir que o sistema atenda tanto às expectativas dos usuários quanto às necessidades dos stakeholders. Técnicas como entrevistas e workshops são ferramentas valiosas para coletar e organizar essas informações de forma estruturada, permitindo uma base sólida para o desenvolvimento do sistema."
            ]
        },
        {
            "unidade": [
                "EXERCITANDO",
                "Questão 1",
                "Diferencie requisitos funcionais de requisitos não funcionais e forneça um exemplo de cada um para um sistema de e-commerce.",
                "",
                "Questão 2",
                "Explique por que o levantamento de requisitos é essencial para evitar retrabalho no desenvolvimento de software.",
                "",
                "Questão 3",
                "Requisitos funcionais e não funcionais são os dois pilares do levantamento de requisitos. Requisitos funcionais descrevem o que o sistema deve fazer, enquanto requisitos não funcionais detalham as qualidades e as restrições que garantem uma boa experiência de uso.",
                "Com base no material estudado, assinale a alternativa que melhor exemplifica um requisito não funcional para um sistema de e-commerce.",
                "a) O sistema deve permitir que os usuários façam login utilizando e-mail e senha.",
                "b) O sistema deve calcular automaticamente o valor do frete com base no CEP do cliente.",
                "c) O sistema deve carregar as páginas de produtos em até dois segundos.",
                "d) O sistema deve enviar e-mails de confirmação para cada compra realizada.",
                "Gabarito: c"
            ]
        },
        {
            "unidade": [
                "RECAPITULANDO",
                "Neste capítulo, exploramos o processo de levantamento de requisitos, a etapa inicial e fundamental no desenvolvimento de sistemas. Discutimos as diferenças entre requisitos funcionais – que definem o que o sistema deve fazer – e requisitos não funcionais – que descrevem como o sistema deve se comportar para oferecer uma experiência de qualidade.",
                "Também abordamos as principais técnicas de coleta de informações, como entrevistas, questionários e workshops, que ajudam a captar as expectativas dos stakeholders de maneira estruturada. Por fim, reforçamos a importância de documentar os requisitos de forma clara e detalhada para garantir que o sistema atenda às necessidades e às expectativas de todos os envolvidos.",
                "Com esse conhecimento, você está preparado(a) para conduzir um levantamento de requisitos eficaz, que servirá de base para um desenvolvimento bem-sucedido e alinhado com os objetivos do projeto.",
                "",
                "#IMAGEM#",
                "#Capítulo#"
            ]
        }
    ]
}]